import 'package:flutter/material.dart';

class work extends StatefulWidget {
  const work({Key? key}) : super(key: key);

  @override
  _workState createState() => _workState();
}

class _workState extends State<work> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.deepOrange.shade800,
        title: Text("কর্মজীবন", style: TextStyle(fontFamily: ("SolaimanLipi")),),),
      body: SingleChildScrollView(
        child: Column(
          children: [
            SizedBox(height: 20,),
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text("কাজী নজরুল ইসলামের কর্মজীবনঃ",
                style: TextStyle(color: Colors.orange.shade700,fontSize: 25,fontFamily: ("SolaimanLipi")),),
            ),
            SizedBox(height: 20,),
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text("১৯১৭ সালে তিনি সেনা হিসাবে ভারতীয় সেনাবাহিনীতে যোগ দেন এবং তিন বছর ব্যাটালিয়ন কোয়ার্টার মাস্টার  পদে উন্নীত হন। ১৯১৯ সালে সেনাবাহিনীতে কর্মরত অবস্থায় তার “বাউণ্ডুলের আত্মকাহিনী” সওগাত পত্রিকায় প্রকাশিত হয়। \n\n"
                  "এছাড়াও সেইসময় তিনি আরও গল্প লিখেছিলেন হেনা, ব্যথার দান, মেহের নেগার, ঘুমের ঘোরে”। ১৯২০ সালে কবি কাজী নজরুল ইসলাম সেনাবাহিনী কর্ম ত্যাগ করেন এবং কলকাতায় ফিরে কলেজ স্ট্রীটে বঙ্গীয় মুসলমান সাহিত্য সমিতির যোগদান করেন। যেখানে তিনি তার প্রথম কবিতা লেখেন ‘বাঁধন-হারা’। \n\n"
                  "১৯২১ সালে অক্টোবর মাসে বোলপুরের শান্তিনিকেতনে কাজী নজরুল ইসলামের সঙ্গে  রবীন্দ্রনাথ ঠাকুরের দেখা হয় এবং তখন থেকে প্রায় কুড়ি বছর এই দুই কবির মধ্যে যোগাযোগ অক্ষুণ্ণ থাকে। তারা দুজনে একে অপরকে গভীর শ্রদ্ধা করতেন এবং ভালোবাসতেন। \n\n"
                  "১৯২২ সালে তিনি বিদ্রোহী শিরোনাম কবিতা লিখেছিলেন যা “বিজলি” ম্যাগাজিনে প্রকাশিত হয়েছিল। কবিতাটি এক বিদ্রোহী সংবেদনশীলতার বর্ণনা দিয়েছে এবং  সমাজের বিভিন্ন শ্রেণির লোকের কাছ থেকে প্রশংসা পেয়েছিল। \n\n"
                  "১৯২২ সালে তার রাজনৈতিক কবিতা “আনন্দময়ীর আগমনে” ধূমকেতু পত্রিকায় প্রকাশিত হয়। এর ফলে ম্যাগাজিনের অফিসে পুলিশি অভিযানের সময় তাকে গ্রেপ্তার করা হয়েছিল। ১৯২৩ সালে ডিসেম্বর মাসে মুক্তি না হওয়া পর্যন্ত কারাবন্দী থাকাকালীন প্রচুর সংখ্যক কবিতা ও গান রচনা করেছিলেন। \n\n"
                  "অবশেষে, তিনি “খিলাফত” আন্দোলন এবং ভারতীয় জাতীয় কংগ্রেসের সমালোচক হয়েছিলেন ব্রিটিশ সাম্রাজ্য থেকে রাজনৈতিক স্বাধীনতা না নেওয়ার জন্য।  তিনি জনগণকে ব্রিটিশদের বিরুদ্ধে লড়াই করার জন্য উদ্বুদ্ধ করেছিলেন এবং  ‘শ্রমিক প্রজা স্বরাজ দল’ সংগঠিত করেছিলেন। \n\n"
                  "১৯২৬ সাল থেকে তিনি সমাজের দুর্বল অংশের জন্য কবিতা এবং গান রচনা করেছিলেন। পরবর্তীকালে তার রচনাগুলি বিদ্রোহ থেকে ধর্মে রূপান্তরিত হয়েছিল। \n\n"
                  "১৯৩৩ সালে তিনি ‘আধুনিক বিশ্ব সাহিত্য’ শীর্ষক রচনা সংকলন প্রকাশ করেছিলেন, যার বিভিন্ন থিম এবং শৈলী ছিল। তিনি ১০ খণ্ডে শাস্ত্রীয় রাগ, কীর্তন এবং দেশাত্মবোধক গানের উপর ভিত্তি করে ৮০০ টি গান লিখেছিলেন। \n\n"
                  "১৯৩৪ সালে তিনি ভারতীয় থিয়েটার এবং ফিল্মে যোগদান করেন। গিরিশচন্দ্রের গল্প জীবনীর উপরে “ভক্ত ধ্রুব” নামে একটি ছবি প্রকাশ করেন। \n\n"
                  "১৯৩৯ সালে তিনি কলকাতা বেতারের জন্য কাজ শুরু করেন এবং ‘হারমনি’ এবং ‘নবরাগ-মালিকা’ এর মতো সংগীত প্রযোজনা করেন। \n\n"
                  "১৯৪০ সালে, তিনি এ.কে. প্রতিষ্ঠিত ‘নবযুগ’-এর প্রধান সম্পাদক হিসাবে কাজ শুরু করেন। তাঁর সবচেয়ে উল্লেখযোগ্য রচনাগুলি ছিল তাঁর বোধন, শাত-ইল-আরব,খেয়া-পারের তরণী এবং বাদল প্রাতের শরাব প্রভৃতি বিদ্রোহী কবিতাগুলি যা সর্বত্র সমালোচিত প্রশংসা পেয়েছিল। \n\n"
                  "১৯২৬ সালে তিনি দারিদ্র্য শিরোনাম একটি বিখ্যাত কবিতা লিখেছিলেন যা জনসাধারণের কাছ থেকে প্রশংসা পেয়েছিল। ১৯২৮ সালে তিনি ‘মাস্টার ভয়েস গ্রামোফোন সংস্থা’ এর গীতিকার, সুরকার এবং সংগীত পরিচালক হয়েছিলেন। ইন্ডাস্ট্রিতে তাঁর অন্যতম বৃহত্তম কাজ ছিল ‘সিরাজ-উদ-দৌলা’ নামে একটি বায়োপিক নাটকের জন্য গান রচনা এবং পরিচালনা করা।",
                style: TextStyle(fontSize: 20,fontFamily: ("SolaimanLipi")),),
            ),

          ],
        ),
      ),
    );
  }
}
