class HumaunDetails{
  String humaunTitle='';
  String humaunSubtitle='';
  String humaunDetail='';

  HumaunDetails({
    required this.humaunTitle,
    required this.humaunSubtitle,
    required this.humaunDetail
});
}

class HumaunData{
  static List<HumaunDetails> dataOfHumaun(){
    return [
      HumaunDetails(
          humaunTitle: "জন্ম পরিচয়",
          humaunSubtitle: "হুমায়ুন আজাদের জন্ম পরিচয়ঃ",
          humaunDetail: "হুমায়ুন আজাদ ২৮ এপ্রিল ১৯৪৭ সালে তার মাতামহের বাড়ি, তৎকালীন ব্রিটিশ ভারতের (বর্তমানে বাংলাদেশ) অধীন বিক্রমপুরের কামারগাঁয় জন্ম নেন; যেটি বর্তমানে মুন্সিগঞ্জ জেলার শ্রীনগর উপজেলার অন্তর্গত। তার জন্ম নাম ছিল হুমায়ুন কবীর। ১৯৮৮ সালে ২৮ সেপ্টেম্বর নাম পরিবর্তনের মাধ্যম তিনি বর্তমান নাম ধারণ করেন।"),
      HumaunDetails(
          humaunTitle: "পরিবার ও আত্মীয়স্বজন",
          humaunSubtitle: "হুমায়ুন আজাদের পরিবার ও আত্মীয়স্বজনঃ",
          humaunDetail: "হুমায়ুন আজাদের বাবা আবদুর রাশেদ প্রথম জীবনে বিদ্যালয়ে শিক্ষকতা ও পোস্টমাস্টার পদে চাকরি করতেন, পরে ব্যবসায়ী হন। ১৯৯২ খ্রিষ্টাব্দে তার বাবা মৃত্যুবরণ করেন। মা জোবেদা খাতুন ছিলেন গৃহিণী, যিনি ২০০৩ সালে মৃত্যুবরণ করেন।\n\n"
      "দাম্পত্যসঙ্গীঃ লতিফা কোহিনূর (বি. ১৯৭৫; মৃত্যুপূর্ব ২০০৪ )।\n\n"
          "সন্তানঃ মৌলি আজাদ, স্মিতা আজাদ, অনন্য আজাদ ।"),
      HumaunDetails(
          humaunTitle: "শৈশবকাল",
          humaunSubtitle: "হুমায়ুন আজাদের শৈশবকালঃ",
          humaunDetail: "তিন ভাই এবং দুই বোনের মধ্যে আজাদ ছিলেন পিতামাতার দ্বিতীয় পুত্রসন্তান। ছেলেবেলায় তার ১৫ বছর বয়স পর্যন্ত তিনি রাড়িখাল গ্রামে বেড়ে ওঠেন। পরবর্তীতে তার বিভিন্ন লেখায় বিভিন্ন ভাবে রাড়িখাল গ্রামের বর্ণনা উঠে এসেছে এবং এ গ্রাম নিয়ে তিনি 'রাড়িখাল : ঘুমের ভেতরে নিবিড় শ্রাবণধারা' নামে একটি লেখা প্রকাশ করেন। আজাদের মতে তার শৈশব ও কৈশোর ছিল তার জীবনের শ্রেষ্ঠ খণ্ড, যে সময়ের কথা প্রত্যক্ষ এবং পরোক্ষভাবে তার ফুলের গন্ধে ঘুম আসে না (১৯৮৫), নিজের সঙ্গে নিজের জীবনের মধু (২০০০), শ্রাবণের বৃষ্টিতে রক্তজবা (২০০২) এবং বিভিন্ন লেখায় উঠে এসেছে। আজাদের গ্রামের মাইল দুয়েক দক্ষিণে রয়েছে পদ্মা নদী, রাতের বেলায় নদীতে স্টিমার চলার ধ্বনি শৈশবে তাকে প্রভাবিত করায় তিনি তার প্রথম কাব্যগ্রন্থের নাম দেন অলৌকিক ইস্টিমার (১৯৭৩)।"),
      HumaunDetails(
          humaunTitle: "শিক্ষা জীবন",
          humaunSubtitle: "হুমায়ুন আজাদের শিক্ষা জীবনঃ",
          humaunDetail: "১৯৫২ সালে আজাদ দক্ষিণ রাড়িখাল প্রাথমিক বিদ্যালয়ে ইনফ্যান্ট (প্রাক-প্রাথমিক শিক্ষা) শ্রেণীতে ভর্তি হন, সেখানে তিনি ইনফ্যান্ট থেকে তৃতীয় শ্রেণী পর্যন্ত মোট চার বছর অধ্যয়ন করেন। চতুর্থ শ্রেণীতে পড়ার জন্য তিনি স্যার জে সি বোস ইন্সটিটিউটে ভর্তি হন। ছেলেবেলা থেকেই তিনি ছিলেন মেধাবী। এ বিদ্যালয় থেকে তৎকালীন পূর্ব পাকিস্তান মাধ্যমিক শিক্ষা বোর্ডের অধীনে ১৯৬২ সালে ম্যাট্রিকুলেশন (মাধ্যমিক) পরীক্ষায় উত্তীর্ণ হন।\n\n"
      "১৯৬২ সালে উচ্চশিক্ষার জন্য আজাদ ঢাকায় চলে আসেন। মানবিক বিভাগে পড়ার ইচ্ছা থাকলেও বাবার ইচ্ছায় ১৯৬২ সালের সেপ্টেম্বরে তিনি ঢাকা কলেজে বিজ্ঞান বিভাগে উচ্চ মাধ্যমিক শ্রেণিতে ভর্তি হন। ১৯৬৪ সালে ঢাকা কলেজ থেকে উচ্চ মাধ্যমিক পাশ করেন। এরপর একই বছর তিনি ঢাকা বিশ্ববিদ্যালয়ের কলা অনুষদে বাংলা বিভাগে ভর্তি হন। ১৯৬৭ সালে ঢাকা বিশ্ববিদ্যালয় থেকে বাংলা সাহিত্যে স্নাতক ডিগ্রি এবং ১৯৬৮ সালে একই বিভাগ থেকে স্নাতকোত্তর ডিগ্রি অর্জন করেন। উভয় পরীক্ষায় তিনি প্রথম শ্রেণিতে উত্তীর্ণ হন। হুমায়ুন আজাদ ঢাকা বিশ্ববিদ্যালয়ের পড়াকালীন সলিমুল্লাহ মুসলিম হল ছাত্রাবাসে থাকতেন।"),
      HumaunDetails(
          humaunTitle: "বৈবাহিক জীবন",
          humaunSubtitle: "হুমায়ুন আজাদের বৈবাহিক জীবনঃ",
          humaunDetail: "হুমায়ুন আজাদ ১৯৬৮ সালে ঢাকা বিশ্ববিদ্যালয়ে স্নাতকোত্তর পড়ার সময় লতিফা কোহিনুর নামের এক তরুণীর সঙ্গে পরিচিত হন এবং ১৯৭৫ সালের ১২ই অক্টোবর তাদের বিয়ে হয় টেলিফোনে; আজাদ তখন স্কটল্যান্ডে আর লতিফা বাংলাদেশে ছিলেন।"),
      HumaunDetails(
          humaunTitle: "কর্মজীবন",
          humaunSubtitle: "হুমায়ুন আজাদের কর্মজীবনঃ",
          humaunDetail: "১৯৬৯ খ্রিষ্টাব্দে ২২ বছর বয়সে তার কর্মজীবন শুরু হয় চট্টগ্রাম কলেজে প্রভাষক হিসাবে। সেখানে কিছুকাল কর্মরত থাকার পর ১৯৭০ সালের ১১ ফেব্রুয়ারি তিনি চট্টগ্রাম বিশ্ববিদ্যালয়ের বাংলা বিভাগে প্রভাষক হিসাবে নিয়োগপ্রাপ্ত হন। একই বছর ১২ ডিসেম্বর তিনি জাহাঙ্গীরনগর বিশ্ববিদ্যালয়ে বাংলা বিভাগে প্রভাষক হিসাবে যোগ দেন। ১৯৭৩ সালে তার প্রথম গবেষণা গ্রন্থ রবীন্দ্রপ্রবন্ধ: রাষ্ট্র ও সমাজচিন্তা এবং একইবছর সেপ্টেম্বরে কাব্যগ্রন্থ অলৌকিক ইস্টিমার প্রকাশিত হয়। সে বছরের সেপ্টেম্বরে তিনি কমনওয়েলথ বৃত্তি নিয়ে ভাষাবিজ্ঞান পড়তে স্কটল্যান্ডে চলে যান। ১৯৭৬ সালে তিনি স্কটল্যান্ডের এডিনবরা বিশ্ববিদ্যালয় থেকে ভাষাবিজ্ঞানে পিএইচডি ডিগ্রি লাভ করেন। তার গবেষণার বিষয় ছিল বাংলা ভাষায় সর্বনামীয়করণ। এই গবেষণাপত্র ১৯৮৩ সালে প্রোনোমিনালাইজেশন ইন বেঙলি নামে ঢাকা বিশ্ববিদ্যালয়ের দ্য ইউনিভার্সিটি প্রেস লিমিটেড থেকে প্রকাশিত হয়। এডিনবরায় গবেষণাকালীন সময়ে তিনি রবার্ট ক্যাল্ডরের সহযোগিতায় কবি জীবনানন্দ দাশ এবং নিজের কিছু কবিতা অনুবাদ করেছিলেন, যেগুলি 'লিডস বিশ্ববিদ্যালয় জার্নাল' এবং এডিনবরার বিশ্ববিদ্যালয়ের 'চ্যাপম্যান' সাময়িকপত্রে প্রকাশিত হয়েছিল।\n\n"
          "১৯৭৮ সালের ১ নভেম্বর আজাদ ঢাকা বিশ্ববিদ্যালয়ে সহযোগী অধ্যাপক হিসাবে যোগদান করেন এবং পরবর্তীকালে বাংলা বিভাগের সভাপতির দায়িত্ব পালন করেন। ১৯৮৬ সালে তিনি অধ্যাপক পদে উন্নীত হন।"),
      HumaunDetails(
          humaunTitle: "রচনাবলি",
          humaunSubtitle: "হুমায়ুন আজাদের রচনাবলিঃ",
          humaunDetail: "কবিতাঃ\n"
    "হুমায়ুন আজাদ কবিতার দ্বারা লেখালেখিতে হাত দিয়েছিলেন, তিনি যখন ঢাকা বিশ্ববিদ্যালয়ের ছাত্র ছিলেন তখনই তিনি মূলত কবিতা রচনায় আগ্রহী হয়ে ওঠেন এবং বিশ্ববিদ্যালয়-জীবন শেষ করার পরেও ১৯৭২ সাল পর্যন্ত তিনি কবিতা লিখতে থাকেন। ষাটের দশকের পরিব্যাপ্ত হতাশা, দ্রোহ, ঘৃণা, বিবমিষা, প্রেম ইত্যাদি তার কবিতার প্রধান বিষয় ছিলো। তার প্রথম কাব্যগ্রন্থের নাম অলৌকিক ইস্টিমার যা প্রথম প্রকাশিত হয় ১৯৭৩-এর জানুয়ারিতে। কাব্যগ্রন্থটি তিনি উৎসর্গ করেন ১৯৬৮-১৯৭২ সালে তার নিজেরই কাটানো রাত-দিনগুলোর উদ্দেশ্যে। তার দ্বিতীয় কাব্যগ্রন্থ জ্বলো চিতাবাঘ প্রথম প্রকাশিত হয় মার্চ ১৯৮০ সালে। ১৯৮৫ সালে প্রকাশিত সবকিছু নষ্টদের অধিকারে যাবে, তৃতীয় কাব্যগ্রন্থটি তিনি সমসাময়িক দুই বাংলাদেশী লেখক হুমায়ূন আহমেদ এবং ইমদাদুল হক মিলনকে উৎসর্গ করেছেন। প্রত্যুত্তরে ইমদাদুল হক মিলন তার বনমানুষ উপন্যাসটি হুমায়ুন আজাদকে উৎসর্গ করেন। ১৯৮৭ সালের মার্চে প্রকাশিত হয় তার চতুর্থ কাব্যগ্রন্থ যতোই গভীরে যাই মধু যতোই ওপরে যাই নীল। তার পঞ্চম কাব্যগ্রন্থ আমি বেঁচে ছিলাম অন্যদের সময়ে প্রকাশিত হয় ফেব্রুয়ারি ১৯৯০ সালে। এর আট বছর পর ফেব্রুয়ারি ১৯৯৮ সালে প্রকাশিত হয় তার ষষ্ঠ কাব্যগ্রন্থ কাফনে মোড়া অশ্রুবিন্দু। কাব্যগ্রন্থটি আজাদ তার 'প্রিয় মৃতদের জন্য' উৎসর্গ করেন। সপ্তম এবং শেষ কাব্যগ্রন্থ পেরোনোর কিছু নেই প্রকাশিত হয় ফেব্রুয়ারি, ২০০৪ সালে। জীবদ্দশায় তার সাতটি কাব্যগ্রন্থ প্রকাশিত হয়। তবে আজাদের মৃত্যুর পর ফেব্রুয়ারি, ২০০৫ সালে এই সাতটি কাব্যগ্রন্থ সহ আরো কিছু অগ্রন্থিত ও অনূদিত কবিতা নিয়ে কাব্যসমগ্র প্রকাশিত হয়। নব্বইয়ের দশক থেকে ঢাকার আগামী প্রকাশনী তার গ্রন্থাবলীর প্রধান প্রকাশক ছিল।\n\n"
          "গল্পঃ\n"
    "হুমায়ুন আজাদ সর্বপ্রথম একটি ছোটগল্প লিখেছিলেন এডিনবরা বিশ্ববিদ্যালয়ের পড়া শেষ করে স্কটল্যান্ড থেকে এসে, গল্পটির নাম তিনি দিয়েছিলেন অনবরত তুষারপাত। এই গল্পটি তিনি পরে দৈনিক ইত্তেফাক পত্রিকাতে ১৯৭৯ সালে প্রকাশ করেছিলেন। এই গল্পটি সহ ১৯৯৫ সাল পর্যন্ত লেখা আরও পাঁচটি গল্প তিনি যাদুকরের মৃত্যু (১৯৯৬) বইতে সংকলিত করেছিলেন। এরপর তিনি শিশুকিশোরদের জন্য আরো তিনটি গল্প লিখেন যেগুলো তিনি কিছু শিশুতোষ কবিতা সহ বুকপকেটে জোনাকি পোকা (১৯৯৩) গ্রন্থে সংকলন করেন।\n\n"
      "প্রবন্ধঃ\n"
    "১৯৭৬ সালে প্রথম প্রকাশিত 'লাল নীল দীপাবলি বা বাঙলা সাহিত্যের জীবনী' বইটি ছিলো হুমায়ুন আজাদের দ্বিতীয় প্রবন্ধ, এর আগে তিনি 'রবীন্দ্রপ্রবন্ধ: রাষ্ট্র ও সমাজচিন্তা' (১৯৭৩) নামের একটি প্রবন্ধ লিখেছিলেন।\n\n"
          "১৯৯২ সালে প্রকাশিত নারী স্বাধীন বাংলাদেশে নারীবাদ বিষয়ক প্রথম বই। এই প্রবন্ধগ্রন্থের জন্য তিনি তীব্র সমালোচিত হন। ফলে ১৯৯৫ সালের ১৯ নভেম্বর তৎকালীন বাংলাদেশ সরকার কর্তৃক বইটি নিষিদ্ধ ঘোষণা করা হয়[৩১] এবং প্রায় সাড়ে চার বছর পরে ২০০০ সালের ৭ মার্চ উচ্চবিচারালয় বইটির নিষিদ্ধকরণ আদেশ বাতিল করে।\n\n"
          "ফরাসি নারীবাদী দার্শনিক সিমোন দ্যা বোভোয়ারের ১৯৪৯ সালের গ্রন্থ দ্বিতীয় লিঙ্গ হুমায়ুন আজাদ ২০০১ সালে বাংলায় অনুবাদ করেন। সিমোন দ্যা বোভোয়ারের লেখা তাকে নারীবাদের প্রতি অনেক আকৃষ্ট করেছিল।\n\n"
          "ফেব্রুয়ারি ২০০৩ সালে প্রকাশিত 'আমরা কি এই বাঙলাদেশ চেয়েছিলাম' গ্রন্থে তিনি তার স্বপ্নের বাংলাদেশের করুণ অবস্থা দেখে ব্যথিত হয়েছিলেন। বইটিতে তিনি বর্ণনা করেছিলেন যে তিনি যেরকম প্রগতিশীল বাংলাদেশের স্বপ্ন দেখতেন তার স্বপ্ন আগেই ভেঙে গেছে, তিনি বাংলাদেশের সমাজের অধঃপতন খুবই আক্ষেপের সঙ্গে প্রকাশ করেছিলেন। তাছাড়া ২০০০ সালে প্রকাশিত মহাবিশ্ব ছিলো একটি বিজ্ঞান-প্রবন্ধ।"),
      HumaunDetails(
          humaunTitle: "পুরস্কার ও সম্মাননা",
          humaunSubtitle: "হুমায়ুন আজাদের পুরস্কার ও সম্মাননাঃ",
          humaunDetail: "বাংলা একাডেমি পুরস্কার	(১৯৮৬),\n"
              "অগ্রণী ব্যাংক-শিশু সাহিত্য পুরস্কার	(১৯৮৬),\n"
          "মার্কেন্টাইল ব্যাংক পুরস্কার	(২০০৪),\n"
          "একুশে পদক	(২০১২) ।"),
      HumaunDetails(
          humaunTitle: "মৃত্যু",
          humaunSubtitle: "হুমায়ুন আজাদের মৃত্যুঃ",
          humaunDetail: "২০০২ খ্রিষ্টাব্দে তিনি জার্মান কবি হাইনরিখ হাইনের উপর কাজ করার জন্য জার্মান সরকারের নিকট একটি বৃত্তির আবেদন করেছিলেন। ২০০৪-এর ৭ আগস্ট জার্মান কবি হাইনরিখ হাইনের ওপর গবেষণা বৃত্তি নিয়ে জার্মানি যান।\n\n"
                "২০০৪ খ্রিষ্টাব্দের ১১ আগস্ট রাতে একটি অনুষ্ঠান থেকে প্রত্যাবর্তনের পর আবাসস্থলে আকস্মিকভাবে মৃত্যুর কোলে ঢলে পড়েন হুমায়ুন আজাদ। ১২ আগস্ট আবাসস্থলের নিজ কক্ষে তাকে মৃত অবস্থায় পাওয়া যায়। হুমায়ুন আজাদের মৃত্যুর পর জার্মান সরকারের তত্ত্বাবধানে মিউনিখে তার নিজ বাসভবনে পাওয়া সব জিনিসপত্র ঢাকায় তার পরিবারের কাছে হস্তান্তর করে। ওই জিনিসপত্রের ভেতরেই পাওয়া যায় তার হাতের লেখা তিনটি চিঠি। চিঠি তিনটি আলাদা তিনটি পোস্ট কার্ডে লিখেছেন বড় মেয়ে মৌলিকে, ছোট মেয়ে স্মিতাকে এবং একমাত্র ছেলে অনন্য আজাদকে। অনুমান করা হয়, ওই লেখার অক্ষরগুলোই ছিল তার জীবনের শেষ লেখা। তার মরদেহ কফিনে করে জার্মানি থেকে ঢাকায় আনা হয়। এরপর ঢাকা বিশ্ববিদ্যালয় কেন্দ্রীয় মসজিদে জানাযার নামাজ শেষে তার মরদেহ রাড়িখালে নিয়ে যাওয়া হয় এবং সেখানেই তাকে সমাহিত করা হয় এবং পরে তার কবর সিমেন্ট দিয়ে পাকা করে একটি বইয়ের মত করে বানানো হয়।"),

    ];
  }
}