import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class MaikelDetails{
  String MaikelTitle='';
  String MaikelSubTitle='';
  String MaikelDetail='';
  Icon? MaikelIcon;


  MaikelDetails({
    required this.MaikelTitle,
    required this.MaikelSubTitle,
    required this.MaikelDetail,
    required this.MaikelIcon,
});
}

class MaikelData{
  static List<MaikelDetails> dataOfMaikel(){
    return[
      MaikelDetails(
        MaikelTitle: "জন্ম পরিচয়",
        MaikelSubTitle: "মাইকেল মধুসূদন দত্তের জন্ম পরিচয়ঃ",
        MaikelDetail: "১৮২৪ সালের ২৫ জানুয়ারি বাংলা প্রেসিডেন্সির যশোর জেলার (অধুনা বাংলাদেশ রাষ্ট্রের যশোর জেলার কেশবপুর উপজেলার) সাগরদাঁড়ি গ্রামের এক সম্ভ্রান্ত হিন্দু কায়স্থ পরিবারে মধুসূদন দত্তের জন্ম হয়।",
        MaikelIcon: Icon(Icons.tag_faces),),
      MaikelDetails(
        MaikelTitle: "পরিবার ও আত্মীয়স্বজন",
        MaikelSubTitle: "মাইকেল মধুসূদন দত্তের পরিবার ও আত্মীয়স্বজনঃ",
        MaikelDetail: "পিতাঃ রাজনারায়ণ দত্ত ।\n""মাতাঃ জাহ্নবী দেবী ।\n""দাম্পত্যসঙ্গীঃ রেবেকা ম্যাকটাভিস হেনরিতা সোফিয়া হোয়াইট ।\n""সন্তানঃ নেপোলিয়ন, শর্মিষ্ঠা ।",
        MaikelIcon: Icon(Icons.group),),
      MaikelDetails(
        MaikelTitle: "শৈশবকাল",
        MaikelSubTitle: "মাইকেল মধুসূদন দত্তের শৈশবকালঃ",
        MaikelDetail: "সাগরদাঁড়িতেই মধুসূদনের বাল্যকাল অতিবাহিত হয়। মধুসূদনের যখন তেরো বছর বয়স, সেই সময় থেকে তাকে কলকাতায় বসবাস করতে হত।",
        MaikelIcon: Icon(Icons.child_care),),
      MaikelDetails(
        MaikelTitle: "শিক্ষা জীবন",
        MaikelSubTitle: "মাইকেল মধুসূদন দত্তের শিক্ষা জীবনঃ",
        MaikelDetail: "মধুসূদনের প্রাথমিক শিক্ষা শুরু হয় তার মা জাহ্নবী দেবীর কাছে। জাহ্নবী দেবীই তাকে রামায়ণ, মহাভারত, পুরাণ প্রভৃতির সঙ্গে সুপরিচিত করে তোলেন। সাগরদাঁড়ির পাশের গ্রামের শেখপুরা মসজিদের ইমাম মুফতি লুৎফুল হকের কাছে তার প্রাথমিক শিক্ষা শুরু হয়। বিদ্বান ইমামের কাছে তিনি বাংলা, ফারসি ও আরবি পড়েছেন। সাগরদাঁড়িতেই মধুসূদনের বাল্যকাল অতিবাহিত হয়। তেরো বছর বয়সে মধুসূদন কলকাতায় আসেন। স্থানীয় একটি স্কুলে কিছুদিন পড়ার পর তিনি তদনীন্তন হিন্দু কলেজে (বর্তমানে প্রেসিডেন্সি বিশ্ববিদ্যালয়) ভর্তি হন। মধুসূদন মেধাবী ছাত্র ছিলেন। তাই অচিরেই কলেজের অধ্যক্ষ ক্যাপ্টেন ডি. এল. রিচার্ডসনের প্রিয় ছাত্র হয়ে ওঠেন। রিচার্ডসন মধুসূদনের মনে কাব্যপ্রীতি সঞ্চারিত করেছিলেন। হিন্দু কলেজের প্রাক্তন অধ্যাপক ডিরোজিওর স্বদেশানুরাগের স্মৃতিও তাকে বিশেষ উদ্বুদ্ধ করত। এছাড়া কলেজে তার সহপাঠী ছিলেন ভূদেব মুখোপাধ্যায়, রাজনারায়ণ বসু, গৌরদাস বসাক, প্যারীচরণ সরকার প্রমুখ ঊনবিংশ শতাব্দীর বিশিষ্ট ব্যক্তিবর্গ। আঠারো বছর বয়সেই মহাকবি হওয়ার ও বিলাতে যাওয়ার উচ্চাকাঙ্ক্ষা তার মনে বদ্ধমূল হয়ে যায়।\n\n"
                "১৮৪৩ সালে রেভারেন্ড কৃষ্ণমোহন বন্দ্যোপাধ্যায়ের নিকট মধুসূদন খ্রিষ্টধর্ম গ্রহণের ইচ্ছা ব্যক্ত করেন। এরপর ওই বছরই ৯ ফেব্রুয়ারি মিশন রো-তে অবস্থিত ওল্ড মিশন চার্চ নামে এক অ্যাংলিক্যান চার্চে গিয়ে তিনি খ্রিষ্টধর্ম গ্রহণ করেন। তাকে দীক্ষিত করেছিলেন পাদ্রী ডিলট্রি। তিনিই তার 'মাইকেল' নামকরণ করেন। মধুসূদন পরিচিত হন 'মাইকেল মধুসূদন দত্ত' নামে। তার এই ধর্মান্তর সমাজে ব্যাপক আলোড়ন সৃষ্টি করেছিল। রাজনারায়ণ দত্ত তার বিধর্মী পুত্রকে ত্যাজ্যপুত্র ঘোষণা করেন। খ্রিস্টধর্ম গ্রহণের পর মধুসূদন শিবপুরের বিশপস কলেজে থেকে পড়াশোনা চালিয়ে যান। এখানে তিনি গ্রিক, লাতিন, সংস্কৃত প্রভৃতি ভাষা শিক্ষা করেন। রাজনারায়ণ দত্ত তাকে পরিত্যাগ করলেও, বিশপস কলেজে পড়াশোনার ব্যয়ভার বহন করছিলেন। চার বছর পর তিনি টাকা পাঠানো বন্ধ করেন। বিশপস কলেজে কয়েকজন মাদ্রাজি ছাত্রের সঙ্গে মধুসূদনের বন্ধুত্ব হয়েছিল। বিশপস কলেজে অধ্যয়ন শেষ করে যখন কলকাতায় চাকরির চেষ্টা করে ব্যর্থ হন মধুসূদন। তখন তার সেই মাদ্রাজি বন্ধুদের সঙ্গে ভাগ্যান্বেষণে মাদ্রাজে (অধুনা চেন্নাই) চলে যান মধুসূদন। কথিত আছে, আত্মীয়স্বজনের অজ্ঞাতসারে নিজের পাঠ্যপুস্তক বিক্রি করে সেই টাকায় মাদ্রাজ গিয়েছিলেন তিনি।",
        MaikelIcon: Icon(Icons.cast_for_education),),
      MaikelDetails(
        MaikelTitle: "বৈবাহিক জীবন",
        MaikelSubTitle: "মাইকেল মধুসূদন দত্তের বৈবাহিক জীবনঃ",
        MaikelDetail: "মাদ্রাজে আসার কিছুকাল পরেই মধুসূদন রেবেকা ম্যাকটিভিস নামে এক ইংরেজ যুবতীকে বিবাহ করেন। উভয়ের দাম্পত্যজীবন আট বছর স্থায়ী হয়েছিল। রেবেকার গর্ভে মধুসূদনের দুই পুত্র ও দুই কন্যার জন্ম হয়। মাদ্রাজ জীবনের শেষ পর্বে রেবেকার সঙ্গে বিবাহ বিচ্ছেদ হওয়ার অল্পকাল পরে মধুসূদন এমিলিয়া হেনরিয়েটা সোফিয়া নামে এক ফরাসি তরুণীকে বিবাহ করেন। আঁরিয়েতা মধুসূদনের সারাজীবনের সঙ্গিনী ছিলেন। এদিকে মাইকেল তার এক কপি দ্য ক্যাপটিভ লেডি বন্ধু গৌরদাস বসাককে উপহার পাঠালে, গৌরদাস সেটিকে জে ই ডি বেথুনের কাছে উপহার হিসেবে পাঠান। উক্ত গ্রন্থ পাঠ করে অভিভূত বেথুন মাইকেলকে চিঠি লিখে দেশে ফিরে আসতে এবং বাংলায় কাব্যরচনা করতে পরামর্শ দেন। ১৮৫৬ সালে মধুসূদন কলকাতায় ফিরে আসেন। পত্নীকে সেই সময় তিনি সঙ্গে আনেন নি।",
        MaikelIcon: Icon(Icons.group_add),),
      MaikelDetails(
        MaikelTitle: "কর্মজীবন",
        MaikelSubTitle: "মাইকেল মধুসূদন দত্তের কর্মজীবনঃ",
        MaikelDetail: "মধুসূদন মাদ্রাজেও বিশেষ সুবিধা করে উঠতে পারেন নি। স্থানীয় খ্রিষ্টান ও ইংরেজদের সহায়তায় তিনি একটি স্কুলে ইংরেজি শিক্ষকের চাকরি পান। তবে বেতন যা পেতেন, তাতে তার ব্যয়সংকুলান হত না। এই সময় তাই তিনি ইংরেজি পত্রপত্রিকায় লিখতে শুরু করেন। মাদ্রাজ ক্রনিকল পত্রিকায় ছদ্মনামে তার কবিতা প্রকাশিত হতে থাকে। হিন্দু ক্রনিকল নামে একটি পত্রিকাও সম্পাদনা করেছিলেন তিনি। কিন্তু অল্পকালের মধ্যেই অর্থাভাবে পত্রিকাটি বন্ধ করে দিতে হয়। পঁচিশ বছর বয়সে নিদারুণ দারিদ্র্যের মধ্যেই তিনি দ্য ক্যাপটিভ লেডি তার প্রথম কাব্যটির রচনা করেন। কবি ও দক্ষ ইংরেজি লেখক হিসেবে তার সুনাম ছড়িয়ে পড়ে।",
        MaikelIcon: Icon(Icons.work),),
      MaikelDetails(
        MaikelTitle: "রচনাবলি",
        MaikelSubTitle: "মাইকেল মধুসূদন দত্তের রচনাবলিঃ",
        MaikelDetail: "বাংলা রচনা-\n\n"
    "নাটক ও প্রহসনঃ\n"
    "  শর্মিষ্ঠা নাটক (১৮৫৯)\n"
    "  একেই কি বলে সভ্যতা? (১৮৬০)\n"
    "  বুড় সালিকের ঘাড়ে রোঁ (১৮৬০)\n"
    "  পদ্মাবতী নাটক (১৮৬০)\n"
    "  কৃষ্ণকুমারী নাটক (১৮৬১)\n"
    "  মায়া-কানন (১৮৭৪)\n\n"
    "কাব্যঃ\n"
    "  তিলোত্তমাসম্ভব কাব্য (১৮৬০)\n"
    "  মেঘনাদবধ কাব্য (১৮৬১)\n"
    "  ব্রজাঙ্গনা কাব্য (১৮৬১)\n"
    "  বীরাঙ্গনা কাব্য (১৮৬২)\n"
    "  চতুর্দশপদী কবিতাবলী (১৮৬৫)\n"
    "  অনুবাদ গ্রন্থ\n"
    "  হেক্‌টর-বধ (১৮৭১)\n\n"
    "ইংরেজি রচনা-\n\n"
    "কাব্যঃ\n"
    "  কালেক্টেড পোয়েমস\n"
    "  দি অপ্সরি: আ স্টোরি ফ্রম হিন্দু মিথোলজি\n"
    "  দ্য ক্যাপটিভ লেডি\n"
    "  ভিশনস অফ দ্য পাস্ট\n"
    "  কাব্যনাট্য\n"
    "  রিজিয়া: ইমপ্রেস অফ ইন্ডে\n\n"
    "অনুবাদ নাটকঃ\n"
    "  রত্নাবলী\n"
    "  শর্মিষ্ঠা\n"
    "  নীল দর্পণ অর দি ইন্ডিগো প্ল্যান্টিং মিরর\n\n"
    "প্রবন্ধ সাহিত্যঃ\n"
    "  দি অ্যাংলো-স্যাক্সন অ্যান্ড দ্য হিন্দু\n"
    "  অন পোয়েট্রি এটসেট্রা\n"
    "  অ্যান এসে\n\n"
    "অন্যান্য রচনাঃ\n"
    "  আ সাইনপসিস অফ দ্য রুক্মিণী হরণ নাটক",
        MaikelIcon: Icon(Icons.text_snippet),),
      MaikelDetails(
        MaikelTitle: "উপাধি",
        MaikelSubTitle: "মাইকেল মধুসূদন দত্তের উপাধিঃ",
        MaikelDetail: "১৮৪৩ সালে রেভারেন্ড কৃষ্ণমোহন বন্দ্যোপাধ্যায়ের নিকট মধুসূদন খ্রিষ্টধর্ম গ্রহণের ইচ্ছা ব্যক্ত করেন। এরপর ওই বছরই ৯ ফেব্রুয়ারি মিশন রো-তে অবস্থিত ওল্ড মিশন চার্চ নামে এক অ্যাংলিক্যান চার্চে গিয়ে তিনি খ্রিষ্টধর্ম গ্রহণ করেন। তাকে দীক্ষিত করেছিলেন পাদ্রী ডিলট্রি। তিনিই তার 'মাইকেল' নামকরণ করেন। মধুসূদন পরিচিত হন 'মাইকেল মধুসূদন দত্ত' নামে ।",
        MaikelIcon: Icon(Icons.card_giftcard),),
      MaikelDetails(
        MaikelTitle: "মৃত্যু",
        MaikelSubTitle: "মাইকেল মধুসূদন দত্তের মৃত্যুঃ",
        MaikelDetail: "মধুসূদনের শেষ জীবন চরম দুঃখ ও দারিদ্র্যের মধ্য দিয়ে অতিবাহিত হয়। আইন ব্যবসায়ে তিনি তেমন সাফল্য লাভ করতে পারেন নি। তাছাড়া অমিতব্যয়ী স্বভাবের জন্য তিনি ঋণগ্রস্তও হয়ে পড়েন। ১৮৭৩ খ্রিষ্টাব্দের ২৯ জুন আলিপুর জেনারেল হাসপাতালে কপর্দকহীন (অর্থাভাবে) অবস্থায় তিনি মৃত্যুবরণ করেন এবং তাকে কলকাতার সাক‌ুলার রোডে সমাধি দেওয়া হয়।",
        MaikelIcon: Icon(Icons.airline_seat_flat),),


    ];
  }
}