


class SamsuDetails{
  String samsuTitle= '';
  String samsuSubtitle= '';
  String samsuDetail= '';

  SamsuDetails({
    required this.samsuTitle,
    required this.samsuSubtitle,
    required this.samsuDetail
});
}

class SamsuData{
  static List<SamsuDetails> dataOfSamsu(){
    return [
      SamsuDetails(
          samsuTitle: "জন্ম পরিচয়",
          samsuSubtitle: "শামসূর রহমানের জন্ম পরিচয়",
          samsuDetail: "কবি শামসুর রাহমানের জন্ম পুরনো ঢাকার মাহুতটুলি এলাকায় নানাবাড়িতে ।\n\n"
          "কবি শামসুর রাহমান ১৩ জন ভাই-বোনের মধ্যে ছিলেন ৪র্থ।"
      ),
      SamsuDetails(
          samsuTitle: "পরিবার ও আত্মীয়স্বজন",
          samsuSubtitle: "শামসূর রহমানের পরিবার ও আত্মীয়স্বজন",
          samsuDetail: "বাবা মুখলেসুর রহমান চৌধুরী ও মা আমেনা বেগম। \n\n"
      "দাম্পত্য সঙ্গী ছিলেন জোহরা বেগম । সন্তানঃ সুমায়রা আমিন, ফাইয়াজ রাহমান, ফাওজিয়া সাবেরিন, ওয়াহিদুর রাহমান মতিন ও শেবা রাহমান ।"
      ),
      SamsuDetails(
          samsuTitle: "শৈশবকাল",
          samsuSubtitle: "শামসূর রহমানের শৈশবকাল",
          samsuDetail: " পৈতৃক বাড়ি নরসিংদী জেলার রায়পুরা থানার পাড়াতলী গ্রামে।"),
      SamsuDetails(
          samsuTitle: "শিক্ষা জীবন",
          samsuSubtitle: "শামসূর রহমানের শিক্ষা জীবন",
          samsuDetail: "১৯৪৫ সালে পুরনো ঢাকার পোগোজ স্কুল থেকে ম্যাট্রিকুলেশন পাশ করেন। ১৯৪৭ সালে ঢাকা ইন্টারমিডিয়েট কলেজ থেকে আইএ পাশ করেন। এরপর ঢাকা বিশ্ববিদ্যালয়ে ইংরেজি বিভাগে স্নাতক শ্রেণিতে ভর্তি হন এবং তিন বছর নিয়মিত ক্লাস করেন। কিন্তু শেষ পর্যন্ত আর মূল পরীক্ষা দেননি। ১৯৫৩ সালে পাস কোর্সে বিএ পাশ করে তিনি ইংরেজি সাহিত্যে এমএ (প্রিলিমিনারি) পরীক্ষায় দ্বিতীয় বিভাগে দ্বিতীয় স্থান অর্জন করলেও শেষ পর্বের পরীক্ষায় অংশগ্রহণ করেননি।"),
      SamsuDetails(
          samsuTitle: "বৈবাহিক জীবন",
          samsuSubtitle: "শামসূর রহমানের বৈবাহিক জীবন",
          samsuDetail: "১৯৫৫ সালের ৮ই জুলাই শামসুর রাহমান জোহরা বেগমকে বিয়ে করেন। কবির তিন ছেলে ও দুই মেয়ে। তাদের নাম সুমায়রা আমিন, ফাইয়াজ রাহমান, ফাওজিয়া সাবেরিন, ওয়াহিদুর রাহমান মতিন ও শেবা রাহমান।"),
      SamsuDetails(
          samsuTitle: "কর্মজীবন",
          samsuSubtitle: "শামসূর রহমানের কর্মজীবন",
          samsuDetail: "শামসুর রাহমান পেশায় সাংবাদিক ছিলেন। ১৯৫৭ সালে দৈনিক মর্নিং নিউজ-এ সহসম্পাদক হিসেবে কর্মজীবন শুরু করেন। ১৯৫৭ থেকে ১৯৫৯ সাল পর্যন্ত রেডিও পাকিস্তানের অনুষ্ঠান প্রযোজক ছিলেন। এরপর তিনি আবার ফিরে আসেন দৈনিক মর্নিং নিউজ-এ। সেখানে তিনি ১৯৬০ সাল থেকে ১৯৬৪ সাল পর্যন্ত সহযোগী সম্পাদক হিসেবে দায়িত্ব পালন করেন। এরপর ১৯৬৪ সালের নভেম্বর মাসে দৈনিক পাকিস্তান (স্বাধীনতা উত্তর দৈনিক বাংলা) এর সহকারী সম্পাদক পদে যোগ দেন এবং ১৯৭৭ সালের জানুয়ারী পর্যন্ত দায়িত্ব পালন করেন। ১৯৭৭ সালের ফেব্রুয়ারি মাসে তিনি একইসাথে দৈনিক বাংলা ও সাপ্তাহিক বিচিত্রার সম্পাদক নিযুক্ত হন। ১৯৮৭ সালে সামরিক সরকারের শাসনামলে তাকে পদত্যাগে বাধ্য করা হয়। এরপর তিনি অধুনা নামের একটি মাসিক সাহিত্য পত্রিকার সম্পাদক হিসেবে দায়িত্ব পালন করেন।"),
      SamsuDetails(
          samsuTitle: "রচনাবলি",
          samsuSubtitle: "শামসূর রহমানের রচনাবলি",
          samsuDetail: "কাব্যগ্রন্থ - ৬৬( * ''প্রথম গান, দ্বিতীয় মৃত্যুর আগে'' (১৯৬০) * ''রৌদ্র করোটিতে'' (১৯৬৩) * ''বিধ্বস্ত নিলীমা'' (১৯৬৭) * ''নিরালোকে দিব্যরথ'' (১৯৬৮) * ''নিজ বাসভূমে'' (১৯৭০) * ''বন্দী শিবির থেকে'' (১৯৭২) * ''দুঃসময়ে মুখোমুখি'' (১৯৭৩) * ''ফিরিয়ে নাও ঘাতক কাটা'' (১৯৭৪) * ''আদিগন্ত নগ্ন পদধ্বনি'' (১৯৭৪) * ''এক ধরনের অহংকার'' (১৯৭৫) * ''আমি অনাহারী'' (১৯৭৬) * ''শূন্যতায় তুমি শোকসভা'' (১৯৭৭) * ''বাংলাদেশ স্বপ্ন দেখে'' (১৯৭৭) * ''প্রতিদিন ঘরহীন ঘরে'' (১৯৭৮) * ''প্রেমের কবিতা'' (১৯৮১) * ''ইকারুসের আকাশ'' (১৯৮২) * ''মাতাল ঋত্বিক'' (১৯৮২) * ''উদ্ভট উটের পিঠে চলেছে'' (১৯৮৩) * ''কবিতার সঙ্গে গেরস্থালি'' (১৯৮৩) * ''নায়কের ছায়া'' (১৯৮৩) * ''আমার কোন তাড়া নেই'' (১৯৮৪) * ''যে অন্ধ সুন্দরী কাঁদে'' (১৯৮৪) * ''অস্ত্রে আমার বিশ্বাস নেই'' (১৯৮৫) * ''হোমারের স্বপ্নময় হাত'' (১৯৮৫) * ''শিরোনাম মনে পড়ে না'' (১৯৮৫) * ''ইচ্ছে হয় একটু দাঁড়াই'' (১৯৮৫) * ''ধুলায় গড়ায় শিরস্ত্রাণ'' (১৯৮৫) * ''এক ফোঁটা কেমন অনল'' (১৯৮৬) * ''টেবিলে আপেলগুলো হেসে উঠে'' (১৯৮৬) * ''দেশদ্রোহী হতে ইচ্ছে করে'' (১৯৮৬) * ''অবিরল জলভূমি'' (১৯৮৬) * ''আমরা ক'জন সঙ্গী'' (১৯৮৬) * ''ঝর্ণা আমার আঙুলে'' (১৯৮৭) * ''স্বপ্নেরা ডুকরে উঠে বারবার'' (১৯৮৭) * ''খুব বেশি ভালো থাকতে নেই'' (১৯৮৭) * ''মঞ্চের মাঝখানে'' (১৯৮৮) * ''বুক তার বাংলাদেশের হৃদয়'' (১৯৮৮) * ''হৃদয়ে আমার পৃথিবীর আলো'' (১৯৮৯) * ''সে এক পরবাসে'' (১৯৯০) * ''গৃহযুদ্ধের আগে'' (১৯৯০) * ''খন্ডিত গৌরব'' (১৯৯২) * ''ধ্বংসের কিনারে বসে'' (১৯৯২) * ''হরিণের হাড়'' (১৯৯৩) * ''আকাশ আসবে নেমে'' (১৯৯৪) * ''উজাড় বাগানে'' (১৯৯৫) * ''এসো কোকিল এসো স্বর্ণচাঁপা'' (১৯৯৫) * ''মানব হৃদয়ে নৈবদ্য সাজাই'' (১৯৯৬) * ''তুমিই নিঃশ্বাস তুমিই হৃৎস্পন্দন'' (১৯৯৬) * ''তোমাকেই ডেকে ডেকে রক্তচক্ষু কোকিল হয়েছি'' (১৯৯৭) * ''হেমন্ত সন্ধ্যায় কিছুকাল'' (১৯৯৭) * ''ছায়াগণের সঙ্গে কিছুক্ষণ'' (১৯৯৭) * ''মেঘলোকে মনোজ নিবাস'' (১৯৯৮) * ''সৌন্দর্য আমার ঘরে'' (১৯৯৮) * ''রূপের প্রবালে দগ্ধ সন্ধ্যা রাতে'' (১৯৯৮) * ''টুকরা কিছু সংলাপের সাঁকো'' (১৯৯৮) * ''স্বপ্নে ও দুঃস্বপ্নে বেচে আছি'' (১৯৯৯) * ''নক্ষত্র বাজাতে বাজাতে'' (২০০০) * ''শুনি হৃদয়ের ধ্বনি'' (২০০০) * ''হৃদপদ্মে জ্যোৎস্না দোলে'' (২০০১) * ''ভগ্নস্তূপে গোলাপের হাসি'' (২০০২) * ''ভাঙাচোরা চাঁদ মুখ কালো করে ধুকছে'' (২০০৩) * ''গন্তব্য নাই বা থাকুক'' (২০০৪) * ''কৃষ্ণপক্ষে পূর্ণিমার দিকে'' (২০০৪) * ''গোরস্থানে কোকিলের করুণ আহবান'' (২০০৫) * ''অন্ধকার থেকে আলোয়'' (২০০৬) * ''না বাস্তব না দুঃস্বপ্ন'' (২০০৬)\n\n"
    "উপন্যাস - ৪টি ‘অক্টোপাশ’ (১৯৮৩), ’অদ্ভুত আঁধার এক’ (১৯৮৫), ‘নিয়ত মন্তাজ’ (১৯৮৫), ‘এলো সে অবেলায়’ (১৯৯৪),\n\n"
    "প্রবন্ধগ্রন্থ - ‘আমৃত্যু তাঁর জীবনানন্দ’ (১৯৮৬), ‘কবিতা এক ধরনের আশ্রয়’ (২০০২)\n\n"
    "শিশু কিশোর সাহিত্য,\n\n"
    "আত্মস্মৃতি,\n\n"
    "অনুবাদ কবিতা - ৩টি,\n\n"
    "অনুবাদ নাটক - ৩টি ।"),
      SamsuDetails(
          samsuTitle: "পুরস্কার ও সম্মাননা",
          samsuSubtitle: "শামসূর রহমানের পুরস্কার ও সম্মাননা",
          samsuDetail: "আদমজী সাহিত্য পুরস্কার,\n\n"
    "বাংলা একাডেমি পুরস্কার,\n"
    "একুশে পদক,\n"
    "নাসির উদ্দিন স্বর্ণপদক,\n"
    "জীবনানন্দ পুরস্কার,\n"
    "আবুল মনসুর আহমেদ স্মৃতি পুরস্কার,\n"
    "মিতসুবিসি পুরস্কার (সাংবাদিতার জন্য),\n"
    "স্বাধীনতা পদক,\n"
    "আনন্দ পুরস্কার ।\n\n"
    "ভারতের যাদবপুর বিশ্ববিদ্যালয় এবং রবীন্দ্রভারতী বিশ্ববিদ্যালয় কবিকে সম্মানসূচক ডি.লিট উপাধিতে ভূষিত করে।"),
      SamsuDetails(
          samsuTitle: "মৃত্যু",
          samsuSubtitle: "শামসূর রহমানের মৃত্যু",
          samsuDetail: "কবি শামসুর রাহমান ২০০৬ সালের ১৭ই আগস্ট বৃহস্পতিবার সন্ধ্যা ৬টা বেজে ৩৫ মিনিটে ঢাকায় বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয়ে চিকিৎসাধীন অবস্থায় শেষ নিঃশ্বাস ত্যাগ করেন। তার ইচ্ছানুযায়ী ঢাকাস্থ বনানী কবরস্থানে, নিজ মায়ের কবরের পাশে তাকে সমাধিস্থ করা হয়।"),
    ];
  }
}