class RabindraDetails{
  String jonmoTitle='';
  String jonmoDetails='';
  String jonmoSubTitle='';


  RabindraDetails({
    required this.jonmoTitle,
    required this.jonmoDetails,
    required this.jonmoSubTitle,

});
}


class rabindraData{
  static List<RabindraDetails> dataOfRabindra(){
    return [
      RabindraDetails(

        jonmoTitle: "জন্ম পরিচয়",
        jonmoDetails: "নামঃ রবীন্দ্রনাথ ঠাকুর ।\n\n"
        "কলকাতায় জোড়াসাঁকোর ঠাকুরবাড়িতে এক ধনী ও সংস্কৃতিবান পরিবারে রবীন্দ্রনাথ ঠাকুর জন্মগ্রহণ করেছিলেন ১৮৬১ সালের ৭ই মে। বাবা ছিলেন দেবেন্দ্রনাথ ঠাকুর এবং মা সারদাসুন্দরী দেবী। রবীন্দ্রনাথ ছিলেন তাঁর বাবামায়ের চতুর্দশ সন্তান।",
        jonmoSubTitle: "রবীন্দ্রনাথ ঠাকুরের জন্ম পরিচয়ঃ",
      ),
      RabindraDetails(
        jonmoTitle: "পরিবার ও আত্মীয়স্বজন",
        jonmoDetails: "পিতাঃ দেবেন্দ্রনাথ ঠাকুর\n""মাতাঃ সারদাসুন্দরী দেবী\n""স্ত্রীঃ মৃণালিনী দেবী\n""রবীন্দ্রনাথ ও মৃণালিনীর পাঁচজন সন্তান জন্মেছিল,  দুই সন্তান তাদের বাল্যবয়সেই মারা যায়।",
        jonmoSubTitle: "রবীন্দ্রনাথ ঠাকুরের পরিবার ও আত্মীয়স্বজনঃ",
      ),
      RabindraDetails(
        jonmoTitle: "শৈশবকাল",
        jonmoDetails: "ছোটবেলায় প্রথাগত বিদ্যালয় শিক্ষা তিনি নেননি। বাড়িতে গৃহশিক্ষক রেখে তাঁর শিক্ষার ব্যবস্থা করা হয়েছিল। স্কুলের বাঁধাধরার মধ্যে প্রাতিষ্ঠানিক শিক্ষায় ছোটবেলা থেকেই ছিল তাঁর অনাগ্রহ। তাঁর 'জীবনস্মৃতি' বইয়ে রবীন্দ্রনাথ লিখেছিলেন, যে অল্পকাল তিনি স্কুলে পড়েছিলেন সেসময় স্কুলের পাঠ ও পরিবেশ এবং স্কুলের দিনগুলো তাঁর কাছে কেমন মুখবিবরের মধ্যে প্রাত্যহিক বরাদ্দ গ্রাসপিণ্ডের মত লাগত।\n\n"
            "জোড়াসাঁকোর ঠাকুরবাড়িতে বা কলকাতার বাইরে পারিবারিক বাগানবাড়িতে প্রাকৃতিক পরিবেশের মধ্যে ঘুরে বেড়াতেই বেশি স্বচ্ছন্দবোধ করতেন তিনি।\n\n"
            "রবীন্দ্রনাথ মাকে হারিয়েছিলেন তাঁর চোদ্দ বছর বয়সে। তাঁর বাবা অনেক সময় কাটাতেন দেশের বাইরে। ফলে রবীন্দ্রনাথের ছেলেবেলা কেটেছিল গৃহভৃত্যদের শাসন ও সান্নিধ্যে।",
        jonmoSubTitle: "রবীন্দ্রনাথ ঠাকুরের শৈশবকালঃ",
      ),
      RabindraDetails(
        jonmoTitle: "শিক্ষা জীবন",
        jonmoDetails: "ছোটবেলায় প্রথাগত বিদ্যালয় শিক্ষা তিনি নেননি। বাড়িতে গৃহশিক্ষক রেখে তাঁর শিক্ষার ব্যবস্থা করা হয়েছিল। স্কুলের বাঁধাধরার মধ্যে প্রাতিষ্ঠানিক শিক্ষায় ছোটবেলা থেকেই ছিল তাঁর অনাগ্রহ।\n\n"
            "তাঁর যখন এগারো বছর বয়স তখন তিনি কয়েকমাসের জন্য বাবার সঙ্গে ভারতের বিভিন্ন জায়গা ঘুরতে বেরিয়েছিলেন। এর মধ্যে পাঞ্জাবে হিমালয় পাহাড় ঘেরা ডালহাউসি শহরে থাকাকালীন বাবার কাছে তিনি সংস্কৃত, ইংরেজি, জ্যোতির্বিজ্ঞান, সাধারণ বিজ্ঞান ও ইতিহাসের নিয়মিত পাঠ নিতেন।\n\n"
            "ওই পাহাড়ি শৈলাবাসে রবীন্দ্রনাথ ঠাকুর ১৮৭৩ সালে লিখেছিলেন তাঁর প্রথম গান গগনের থালে রবি চন্দ্র দীপক জ্বালে। বলা হয় এটি ছিল পাঞ্জাবি একটি ভজনের অনুবাদ। ওই সময় অমৃতসরে এক মাস যখন তিনি বাবার সঙ্গে ছিলেন, তখন বাবা ও ছেলে নিয়মিত যেতেন স্বর্ণমন্দিরে। রবীন্দ্রনাথ তাঁর 'জীবনস্মৃতি'তে লিখেছেন, সেসময় ওই মন্দিরের ভজন সঙ্গীত তাঁর ওপর বড়ধরনের প্রভাব ফেলেছিল।\n\n"
            "রবীন্দ্রনাথ ঠাকুর ব্যারিস্টারি পড়তে ১৮৭৮ সালে সতের বছর বয়সে ইংল্যান্ডে যান। তাঁর বাবা চেয়েছিলেন তিনি আইনজ্ঞ হন। প্রথমে তিনি সমুদ্রতীরের শহর ব্রাইটনে একটি পাবলিক স্কুলে ভর্তি হয়েছিলেন। এক বছর পরে লন্ডনে আসেন আইনবিদ্যা নিয়ে পড়তে। কিন্তু সাহিত্যচর্চ্চার আকর্ষণে সেই পড়াশোনা তিনি শেষ করতে পারেননি।\n\n"
            "ইংল্যান্ডে থাকাকালীন এই সময়ে তিনি শেক্সপিয়র সহ অন্যান্য ইংরেজ সাহিত্যিকদের লেখার সঙ্গে পরিচিত হয়ে উঠেছিলেন। প্রায় দেড় বছর ইংল্যান্ডে কাটিয়ে আইনের পড়া শেষ না করেই তিনি ফিরে যান কলকাতায়।",
        jonmoSubTitle: "রবীন্দ্রনাথ ঠাকুরের শিক্ষা জীবনঃ",
      ),
      RabindraDetails(
        jonmoTitle: "বৈবাহিক জীবন",
        jonmoDetails: "বিয়ে করেন ১৮৮৩ সালে ১০ বছরের কিশোরী মৃণালিনী দেবীকে। জন্মকালে তাঁর নাম ছিল ভবতারিণী এবং তিনি ছিলেন ঠাকুরবাড়ির এক অধস্তন কর্মচারীর মেয়ে। রবীন্দ্রনাথ ও মৃণালিনীর পাঁচজন সন্তান জন্মেছিল, যদিও দুই সন্তান তাদের বাল্যবয়সেই মারা যায়।",
        jonmoSubTitle: "রবীন্দ্রনাথ ঠাকুরের বৈবাহিক জীবনঃ",
      ),
      RabindraDetails(
        jonmoTitle: "কর্মজীবন",
        jonmoDetails: "বাবার আদেশে রবীন্দ্রনাথ ঠাকুর ১৮৯০-৯১ সাল থেকে কুষ্টিয়ার শিলাইদহে, সেইসঙ্গে পাবনা, রাজশাহী ও উড়িষ্যায় পৈত্রিক জমিদারিগুলোর তদারকি শুরু করেন। এর মধ্যে শিলাইদহের কুঠিবাড়িতে রবীন্দ্রনাথ পরিবার নিয়ে দীর্ঘ সময় কাটিয়েছিলেন।\n\n"
            "শিলাইদহে 'পদ্মা' নামে একটি বিলাসবহুল পারিবারিক বজরায় চড়ে প্রজাদের কাছ থেকে খাজনা আদায় করতে যেতেন তিনি। তবে গবেষকরা বলেন তিনি প্রজাদের কাছ থেকে নামমাত্র খাজনা নিতেন।\n\n"
        "১৯০১ পর্যন্ত তিনি কাটিয়েছিলেন শিলাইদহে। সেখানে বসেই তিনি লিখেছিলেন তাঁর বিখ্যাত কাব্যগ্রন্থ সোনার তরী, চিত্রা, ক্ষণিকা ও চৈতালির অসংখ্য কবিতা। গীতাঞ্জলি কাব্যের অনুবাদের কাজও তিনি শুরু করেছিলেন শিলাইদহে।\n\n"
        "রবীন্দ্র গবেষকদের অনেকেই বলেন এসময় প্রজাদের কল্যাণে তিনি বেশ কিছু পদক্ষেপ নিয়েছিলেন। সেখানে থাকাকালে তিনি দেখেছিলেন তাঁদের জমিদারিতেই প্রজারা কীভাবে শোষণের শিকার হয়েছেন। প্রজাদের কল্যাণে তিনি সেখানে একটি দাতব্য চিকিৎসা কেন্দ্রও স্থাপন করেছিলেন।\n\n"
        "ওই সময় তিনি তাঁর গল্পগুচ্ছ বইয়ের প্রায় ৫০টির মত গল্প লেখেন। এসব গল্পে তিনি মূলত গ্রাম বাংলা দারিদ্র ও বঞ্চনার চিত্র তুলে ধরেছিলেন।\n\n"
        "মাত্র ১৬ বছর বয়সে তিনি ছোট গল্প লিখতে শুরু করেন। তাঁর প্রথম ছোট গল্প ছিল 'ভিখারিনী'।\n\n"
        "রবীন্দ্রনাথ ১৯০১ সালে সপরিবারে শিলাইদহ ছেড়ে চলে যান পশ্চিমবঙ্গে বীরভূম জেলার বোলপুর শহরের কাছে শান্তিনিকেতনে। শান্তিনিকেতনে রবীন্দ্রনাথ একটি ব্রহ্মবিদ্যালয় বা ব্রহ্মচর্যাশ্রম নামে একটি স্কুল প্রতিষ্ঠা করেছিলেন ১৯০১ সালে যা কালক্রমে বিশ্বভারতী বিশ্ববিদ্যালয়ে রূপ নেয়। বিশ্বভারতীর আনুষ্ঠানিক উদ্বোধন হয় ১৯২১ সালে।\n\n"
        "এই বিশ্বভারতী বিশ্ববিদ্যালয় ১৯৫১ সালে ভারতের কেন্দ্রীয় বিশ্ববিদ্যালয়ের মর্যাদা লাভ করে।,\n\n"
        "শান্তিনিকেতনে থাকাকালেই অল্প কয়েক বছরের মধ্যে রবীন্দ্রনাথ তাঁর স্ত্রী, এক পুত্র ও এক কন্যাকে হারান। তাঁর পিতৃবিয়োগও ঘটে ১৯০৫ সালে।\n\n"
        "এসবের মধ্যেই রবীন্দ্রনাথ জড়িয়ে পড়েছিলেন ১৯০৫ সালে বঙ্গভঙ্গ বিরোধী স্বদেশী আন্দোলনে। ব্রিটিশ ঔপনিবেশিক শাসক লর্ড কার্জন যখন দেখলেন বাঙালিরা স্বাধীনতা আন্দোলনের জন্য ঐক্যবদ্ধ হচ্ছে, তখন তারা ওই আন্দোলন রুখতে সিদ্ধান্ত নিলেন বাংলাকে দুভাগে ভাগ করে দিতে। এর প্রতিবাদে যে রাজনৈতিক আন্দোলন দানা বেঁধেছিল, তার পুরোভাগে ছিলেন রবীন্দ্রনাথ ঠাকুর।\n\n"
        "ব্রিটিশ সরকারের ওই সিদ্ধান্তের প্রতিবাদে বাংলার নেতারা ব্রিটিশ পণ্য বর্জনের ডাক দিলেন। রবীন্দ্রনাথ তখন শাসকগোষ্ঠির বিরুদ্ধে কলম ধরে যে গানগুলো লিখেছিলেন, তা তখন এক অভিনব উন্মাদনা তৈরি করেছিল।\n\n"
        "তবে স্বদেশী আন্দোলনের সঙ্গে রবীন্দ্রনাথ বেশিদিন প্রত্যক্ষভাবে যুক্ত থাকেননি। রাজনৈতিক নেতারা উত্তেজনাপূর্ণ আন্দোলন-সর্বস্ব, গঠননীতি-বর্জিত যে পথ বেছে নিয়েছিলেন তা তিনি সমর্থন করেননি। কিন্তু তাঁর কিছু কিছু জীবনীকার লিখেছেন রাজনৈতিক আন্দোলনে তাঁর সায় না থাকলেও, যেহেতু তাঁর মন জাতীয়তাবোধে উদ্বুদ্ধ ছিল এবং তিনি ছিলেন খুবই সংবেদনশীল, তাই বিদেশি শাসকরা বড় রকম অন্যায় করছে দেখলে তিনি চুপ করে থাকতে পারতেন না।\n\n""সমাজকল্যাণ, গ্রাম উন্নয়ন ও গ্রামের দরিদ্র মানুষের শিক্ষার প্রয়োজনীয়তার পক্ষে তিনি সোচ্চার ছিলেন। শান্তিনিকেতনের কাছে সুরুল গ্রামে আমেরিকান কৃষি অর্থনীতিবিদ লেনার্ড এলমহার্স্ট এবং শান্তিনিকেতনের শিক্ষক ও ছাত্রদের সহযোগিতায় তিনি গড়ে তুলেছিলেন শ্রীনিকেতন নামে পল্লী উন্নয়ন কেন্দ্র।এই সংস্থার উদ্দেশ্য ছিল কৃষির উন্নতিসাধন, সমবায় প্রথা চালু করা এবং গ্রামের সাধারণ মানুষদের মধ্যে স্বাস্থ্য সচেতনতা বাড়ানো\n\n"
        "ইংল্যান্ডে ডাটিংটন হল স্কুল নামে শ্রীনিকেতনের আদর্শে একটি প্রগতিশীল শিক্ষা প্রতিষ্ঠান স্থাপনে তাঁর ব্যাপক অবদান ছিল। অনেক জাপানি সাহিত্যিক তাঁর দ্বারা অনুপ্রাণিত হয়েছিলেন।",
        jonmoSubTitle: "রবীন্দ্রনাথ ঠাকুরের কর্মজীবনঃ",
      ),
      RabindraDetails(
        jonmoTitle: "রচনাবলি",
        jonmoDetails: "রবীন্দ্রনাথ ঠাকুরের বিপুল সাহিত্যসম্ভারের যেসব হিসাব পাওয়া যায় সে অনুযায়ী তিনি লিখেছিলেন ৫২টি কাব্যগ্রন্থ, ৩৮টি নাটক, ১৩টি উপন্যাস, ৩৬টি প্রবন্ধ এবং অন্যান্য আরও গদ্য, ৯৫টি ছোটগল্প এবং দুহাজারের ওপর গান।\n\n"
          "তাঁর রচিত গান 'আমার সোনার বাংলা' বাংলাদেশের আর 'জনগণমন অধিনায়ক জয় হে' ভারতের জাতীয় সঙ্গীত।\n\n"
          "প্রায় ৭০ বছর বয়সে তিনি ছবি আঁকতে শুরু করেন। ছবি আঁকায় তাঁর কোন প্রথাগত শিক্ষা ছিল না। লেখার কাটাকুটিকে একটা চেহারা দেবার চেষ্টা থেকে তাঁর ছবি আঁকার শুরু। তারপরেও তিনি প্রায় দু হাজার ছবি এঁকেছিলেন।",
        jonmoSubTitle: "রবীন্দ্রনাথ ঠাকুরের রচনাবলিঃ",
      ),
      RabindraDetails(
        jonmoTitle: "পুরস্কার ও সম্মাননা",
        jonmoDetails: "ব্রিটিশ সরকার ১৯১৫ সালে তাঁকে 'নাইট' উপাধিতে ভূষিত করেছিল।\n\n"
            "পাঞ্জাবের জালিয়ানওয়ালাবাগে একটি মর্মান্তিক গণহত্যার প্রতিবাদ জানিয়ে ইংরেজ সরকারের দেওয়া 'নাইট' উপাধি ত্যাগ করেছিলেন রবীন্দ্রনাথ ঠাকুর ১৯১৯ সালের ১৩ই এপ্রিল।\n\n"
        "রবীন্দ্রনাথ ঠাকুর ছিলেন প্রথম অ-ইউরোপীয় যিনি সাহিত্যে নোবেল পুরস্কার পেয়েছিলেন ১৯১৩ সালে। তাঁর কাব্যগ্রন্থ 'গীতাঞ্জলি'র ইংরেজি অনুবাদের জন্য সুইডিশ অ্যাকাডেমি তাঁকে নোবেল পুরস্কার দিয়েছিল।",
        jonmoSubTitle: "রবীন্দ্রনাথ ঠাকুরের পুরস্কার ও সম্মাননাঃ",
      ),
      RabindraDetails(
        jonmoTitle: "মৃত্যু",
        jonmoDetails: "জীবনের শেষ চার পাঁচ বছর ধারাবাহিকভাবে নানা অসুস্থতায় ভুগেছিলেন রবীন্দ্রনাথ। কিন্তু লেখা তিনি কখনও থামাননি। মৃত্যুর সাতদিন আগে পর্যন্তও তিনি ছিলেন সৃষ্টিশীল।\n\n"
          "দীর্ঘ রোগভোগের পর ১৯৪১ সালে জোড়াসাঁকোর বাসভবনেই তাঁর জীবনাবসান হয়।",
        jonmoSubTitle: "রবীন্দ্রনাথ ঠাকুরের মৃত্যুঃ",
      ),

    ];
  }
}