import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class BiddaShagarDetails{
  String BiddaShagarTitle='';
  String BiddaShagarSubTitle='';
  String BiddaShagarDetail='';
  Icon? BiddaShagarIcon;


BiddaShagarDetails({
  required this.BiddaShagarTitle,
  required this.BiddaShagarSubTitle,
  required this.BiddaShagarDetail,
  required this.BiddaShagarIcon,
});
}

class BiddaShagarData{
  static List<BiddaShagarDetails> dataOfBiddaShagar(){
    return [
      BiddaShagarDetails(
        BiddaShagarTitle: "জন্ম পরিচয়",
        BiddaShagarSubTitle: "ঈশ্বর চন্দ্র বিদ্যাসাগরের জন্ম পরিচয়ঃ",
        BiddaShagarDetail: "১৮২০ খ্রিস্টাব্দের ২৬ সেপ্টেম্বর (১২২৭ বঙ্গাব্দের ১২ আশ্বিন, মঙ্গলবার) ব্রিটিশ ভারতের বাংলা প্রেসিডেন্সির বীরসিংহ গ্রামে ঈশ্বরচন্দ্র বন্দ্যোপাধ্যায় শর্মা জন্মগ্রহণ করেন। এই গ্রামটি অধুনা ভারতের পশ্চিমবঙ্গ রাজ্যের পশ্চিম মেদিনীপুর জেলার অন্তর্গত হলেও, সেই যুগে ছিল হুগলি জেলার অন্তর্ভুক্ত।",
        BiddaShagarIcon: Icon(Icons.tag_faces)
      ),
      BiddaShagarDetails(
        BiddaShagarTitle: "পরিবার ও আত্মীয়স্বজন",
        BiddaShagarSubTitle: "ঈশ্বর চন্দ্র বিদ্যাসাগরের পরিবার ও আত্মীয়স্বজনঃ",
        BiddaShagarDetail: "ঈশ্বরচন্দ্রের পিতার নাম ছিল ঠাকুরদাস বন্দ্যোপাধ্যায় ও মাতার নাম ছিল ভগবতী দেবী। বন্দ্যোপাধ্যায় পরিবারের আদি নিবাস ছিল অধুনা হুগলি জেলার বনমালীপুর গ্রাম। ঈশ্বরচন্দ্রের পিতামহ রামজয় তর্কভূষণ ছিলেন সংস্কৃত ভাষা ও সাহিত্যে সুপণ্ডিত ব্যক্তি। তিনিই ঈশ্বরচন্দ্রের নামকরণ করেছিলেন। দাম্পত্যসঙ্গী	দীনময়ী দেবী । সন্তান	নারায়ণচন্দ্র বন্দ্যোপাধ্যায়",
          BiddaShagarIcon: Icon(Icons.group)
      ),
      BiddaShagarDetails(
        BiddaShagarTitle: "শৈশবকাল",
        BiddaShagarSubTitle: "ঈশ্বর চন্দ্র বিদ্যাসাগরের শৈশবকালঃ",
        BiddaShagarDetail: "বন্দ্যোপাধ্যায় পরিবারের আদি নিবাস ছিল অধুনা হুগলি জেলার বনমালীপুর গ্রাম। ঈশ্বরচন্দ্রের পিতামহ রামজয় তর্কভূষণ ছিলেন সংস্কৃত ভাষা ও সাহিত্যে সুপণ্ডিত ব্যক্তি। তিনিই ঈশ্বরচন্দ্রের নামকরণ করেছিলেন। ঠাকুরদাস বন্দ্যোপাধ্যায় কলকাতায় স্বল্প বেতনের চাকরি করতেন। সেই কারণে ঈশ্বরচন্দ্রের শৈশব বীরসিংহেই তার মা ও ঠাকুরমার সঙ্গে অতিবাহিত হয়।",
          BiddaShagarIcon: Icon(Icons.child_care)
      ),
      BiddaShagarDetails(
        BiddaShagarTitle: "শিক্ষা জীবন",
        BiddaShagarSubTitle: "ঈশ্বর চন্দ্র বিদ্যাসাগরের শিক্ষা জীবনঃ",
        BiddaShagarDetail: "চার বছর নয় মাস বয়সে ঠাকুরদাস বালক ঈশ্বরচন্দ্রকে গ্রামের সনাতন বিশ্বাসের পাঠশালায় ভর্তি করে দেন। কিন্তু সনাতন বিশ্বাস বিদ্যাদানের চেয়ে শাস্তিদানেই অধিক আনন্দ পেতেন। সেই কারণে রামজয় তর্কভূষণের উদ্যোগে পার্শ্ববর্তী গ্রামের কালীকান্ত চট্টোপাধ্যায় নামে এক উৎসাহী যুবক বীরসিংহ গ্রামে একটি নতুন পাঠশালা স্থাপন করেন। আট বছর বয়সে এই পাঠশালায় ভর্তি হন ঈশ্বরচন্দ্র। তার চোখে কালীকান্ত ছিলেন আদর্শ শিক্ষক। কালীকান্তের পাঠশালায় তিনি সেকালের প্রচলিত বাংলা শিক্ষা লাভ করেছিলেন।\n\n"
              "১৮২৮ সালের নভেম্বর মাসে পাঠশালার শিক্ষা সমাপ্ত করে উচ্চশিক্ষা লাভের জন্য পিতার সঙ্গে কলকাতায় আসেন। তাদের সঙ্গে কলকাতায় এসেছিলেন কালীকান্ত ও চাকর আনন্দরাম গুটিও। কথিত আছে, পদব্রজে মেদিনীপুর থেকে কলকাতায় আসার সময় পথের ধারে মাইলফলকে ইংরেজি সংখ্যাগুলি দেখে তিনি সেগুলি অল্প আয়াসেই আয়ত্ত করেছিলেন। কলকাতার বড়বাজার অঞ্চলের বিখ্যাত সিংহ পরিবারে তারা আশ্রয় নেন। এই পরিবারের কর্তা তখন জগদ্দুর্লভ সিংহ। ১৮২৯ সালের ১ জুন সোমবার কলকাতা গভর্নমেন্ট সংস্কৃত কলেজে ( যা বর্তমানে  সংস্কৃত কলেজিয়েট স্কুল নামে পরিচিত) ব্যাকরণের তৃতীয় শ্রেণিতে ভর্তি হন তিনি। প্রসঙ্গত উল্লেখ্য, এই সংস্কৃত কলেজের প্রতিষ্ঠা হয়েছিল ১৮২৪ সালে; অর্থাৎ, ঈশ্বরচন্দ্রের এই কলেজে ভর্তি হওয়ার মাত্র পাঁচ বছর আগে। তার বয়স তখন নয় বছর। এই কলেজে তার সহপাঠী ছিলেন মদনমোহন তর্কালঙ্কার। বিদ্যাসাগরের আত্মকথা থেকে জানা যায়, মোট সাড়ে তিন বছর তিনি ওই শ্রেণিতে অধ্যয়ন করেন।\n\n"
              "ব্যাকরণ পড়ার সময় ১৮৩০ সালে সংস্কৃত কলেজের ইংরেজি শ্রেণিতেও ভর্তি হন ঈশ্বরচন্দ্র। ১৮৩১ সালের মার্চ মাসে বার্ষিক পরীক্ষায় কৃতিত্বের জন্য মাসিক পাঁচ টাকা হারে বৃত্তি এবং ‘আউট স্টুডেন্ট’ হিসেবে একটি ব্যাকরণ গ্রন্থ ও আট টাকা পারিতোষিক পান। সংস্কৃত কলেজে মাসিক বৃত্তিপ্রাপ্ত ছাত্রদের ‘পে স্টুডেন্ট’ ও অন্য ছাত্রদের ‘আউট স্টুডেন্ট’ বলা হত। অন্যদিকে তিন বছর ব্যাকরণ শ্রেণিতে পঠনপাঠনের পর বারো বছর বয়সে প্রবেশ করেন কাব্য শ্রেণিতে। সে যুগে এই শ্রেণির শিক্ষক ছিলেন বিশিষ্ট পণ্ডিত জয়গোপাল তর্কালঙ্কার। ১৮৩৩ সালে ‘পে স্টুডেন্ট’ হিসেবেও ঈশ্বরচন্দ্র ২ টাকা পেয়েছিলেন। ১৮৩৪ সালে ইংরেজি ষষ্ঠশ্রেণির ছাত্র ঈশ্বরচন্দ্র বার্ষিক পরীক্ষায় কৃতিত্বের জন্য ৫ টাকা মূল্যের পুস্তক পারিতোষিক হিসেবে পান। এই বছরই ক্ষীরপাই নিবাসী শত্রুঘ্ন ভট্টাচার্যের কন্যা দীনময়ী দেবীর সঙ্গে তার বিবাহ হয়।\n\n"
              "১৮৩৫ সালে ইংরেজি পঞ্চম শ্রেণির ছাত্র রূপে পলিটিক্যাল রিডার নং ৩ ও ইংলিশ রিডার নং ২ পারিতোষিক পান। এই বছরই নভেম্বর মাসে সংস্কৃত কলেজ থেকে ইংরেজি শ্রেণি উঠিয়ে দেওয়া হয়। দ্বিতীয় বর্ষে সাহিত্য পরীক্ষায় প্রথম স্থান অধিকার করে পনেরো বছর বয়সে প্রবেশ করেন অলংকার শ্রেণিতে। অলংকার শাস্ত্র একটি অত্যন্ত কঠিন বিষয়। কিন্তু এক বছরের মধ্যেই তিনি সাহিত্য দর্পণ, কাব্যপ্রকাশ ও রসগঙ্গাধর প্রভৃতি অলংকার গ্রন্থে ব্যুৎপত্তি অর্জন করেন।\n\n"
              "১৮৩৬ সালে অলংকার পাঠ শেষ করেন। বার্ষিক পরীক্ষায় প্রথম স্থান অধিকার করে রঘুবংশম্, সাহিত্য দর্পণ, কাব্যপ্রকাশ, রত্নাবলী, মালতী মাধব, উত্তর রামচরিত, মুদ্রারাক্ষস, বিক্রমোর্বশী ও মৃচ্ছকটিক গ্রন্থ পারিতোষিক পান। ১৮৩৭ সালের মে মাসে তার ও মদনমোহনের মাসিক বৃত্তি বেড়ে হয় আট টাকা।\n\n"
              "এই বছরই ঈশ্বরচন্দ্র স্মৃতি শ্রেণিতে ভর্তি হন (এই অংশের সমতুল্য আজকের সংস্কৃত কলেজ-র পঠন)। সেই যুগে স্মৃতি পড়তে হলে আগে বেদান্ত ও ন্যায়দর্শন পড়তে হত। কিন্তু ঈশ্বরচন্দ্রের মেধায় সন্তুষ্ট কর্তৃপক্ষ তাকে সরাসরি স্মৃতি শ্রেণিতে ভর্তি নেন। এই পরীক্ষাতেও তিনি অসামান্য কৃতিত্বের সাক্ষর রাখেন এবং হিন্দু ল কমিটির পরীক্ষায় উত্তীর্ণ হন। ত্রিপুরায় জেলা জজ পণ্ডিতের পদ পেয়েও পিতার অনুরোধে তা প্রত্যাখ্যান করে ভর্তি হন বেদান্ত শ্রেণিতে। শম্ভুচন্দ্র বাচস্পতি সেই সময় বেদান্তের অধ্যাপক। ১৮৩৮ সালে সমাপ্ত করেন বেদান্ত পাঠ। এই পরীক্ষায় তিনি প্রথম স্থান অধিকার করেন এবং মনুসংহিতা, প্রবোধ চন্দ্রোদয়, অষ্টবিংশতত্ত্ব, দত্তক চন্দ্রিকা ও দত্তক মীমাংসা গ্রন্থ পারিতোষিক পান। সংস্কৃতে শ্রেষ্ঠ গদ্য রচনার জন্য ১০০ টাকা পুরস্কারও পেয়েছিলেন ঈশ্বরচন্দ্র। ১৮৪০-৪১ সালে ন্যায় শ্রেণিতে পঠনপাঠন করেন ঈশ্বরচন্দ্র। এই শ্রেণিতে দ্বিতীয় বার্ষিক পরীক্ষায় একাধিক বিষয়ে তিনি পারিতোষিক পান। ন্যায় পরীক্ষায় প্রথম স্থান অর্জন করে ১০০ টাকা, পদ্য রচনার জন্য ১০০ টাকা, দেবনাগরী হস্তাক্ষরের জন্য ৮ টাকা ও বাংলায় কোম্পানির রেগুলেশন বিষয়ক পরীক্ষায় ২৫ টাকা-সর্বসাকুল্যে ২৩৩ টাকা পারিতোষিক পেয়েছিলেন। বিদ্যাসাগর 'ঈশ্বরচন্দ্র শর্মা' নামে স্বাক্ষর করতেন৷",
          BiddaShagarIcon: Icon(Icons.cast_for_education)
      ),
      BiddaShagarDetails(
        BiddaShagarTitle: "বৈবাহিক জীবন",
        BiddaShagarSubTitle: "ঈশ্বর চন্দ্র বিদ্যাসাগরের বৈবাহিক জীবনঃ",
        BiddaShagarDetail: "মাত্র ১৫ বছর বয়সে অর্থাৎ ১৮৩৫ সালে তিনি দিনময়ী দেবীর সাথে বিবাহ বন্ধনে আবদ্ধ হন ।",
        BiddaShagarIcon: Icon(Icons.group_add)
      ),
      BiddaShagarDetails(
        BiddaShagarTitle: "কর্মজীবন",
        BiddaShagarSubTitle: "ঈশ্বর চন্দ্র বিদ্যাসাগরের কর্মজীবনঃ",
        BiddaShagarDetail: "১৮৪১ সালে সংস্কৃত কলেজে শিক্ষা সমাপ্ত হবার পর সেই বছরই ২৯ ডিসেম্বর মাত্র একুশ বছর বয়সে ফোর্ট উইলিয়াম কলেজের বাংলা বিভাগের সেরেস্তাদার বা প্রধান পণ্ডিতের পদে আবৃত হন বিদ্যাসাগর মহাশয়। বেতন ছিল মাসে ৫০ টাকা। ১৮৪৬ সালের ৫ এপ্রিল পর্যন্ত তিনি এই পদের দায়িত্বে ছিলেন। ১৮৪৬ সালের ৬ এপ্রিল একই বেতন হারে সংস্কৃত কলেজের সহকারী সম্পাদকের ভার গ্রহণ করেন। তখন তার বয়স পঁচিশ বছর। ১৮৪৭ সালে স্থাপন করেন সংস্কৃত প্রেস ডিপজিটরি নামে একটি বইয়ের দোকান। এই বছরই এপ্রিল মাসে প্রকাশিত হয় হিন্দি বেতাল পচ্চিসী অবলম্বনে রচিত তার প্রথম গ্রন্থ বেতাল পঞ্চবিংশতি। প্রথম বিরাম চিহ্নের সফল ব্যবহার করা হয় এ গ্রন্থে। বন্ধু মদনমোহন তর্কালঙ্কারের সম অংশীদারত্বে সংস্কৃত যন্ত্র নামে একটি ছাপাখানাও স্থাপন করেন তিনি। অন্নদামঙ্গল কাব্যের পান্ডুলিপি সংগ্রহের জন্য এই বছরই নদিয়ার কৃষ্ণনগরে আসেন বিদ্যাসাগর মহাশয়। কৃষ্ণনগর রাজবাড়িতে সংরক্ষিত মূল গ্রন্থের পাঠ অনুসারে পরিশোধিত আকারে দুই খণ্ডে অন্নদামঙ্গল সম্পাদনা করেছিলেন তিনি। এই বইটিই সংস্কৃত যন্ত্র প্রেসের প্রথম মুদ্রিত গ্রন্থ। ১৮৪৭ সালের ১৬ জুলাই কলেজ পরিচালনার ব্যাপারে সেক্রেটারি রসময় দত্ত এর সঙ্গে মতান্তর দেখা দেওয়ায় সংস্কৃত কলেজের সম্পাদকের পদ থেকে পদত্যাগ করেন।\n\n"
              "১৮৪৯ সালে মার্শম্যানের হিস্ট্রি অফ বেঙ্গল অবলম্বনে রচনা করেন বাঙ্গালার ইতিহাস দ্বিতীয় ভাগ গ্রন্থখানি। এই বছরেই ১ মার্চ পাঁচ হাজার টাকা জামিনে মাসিক ৮০ টাকা বেতনে ফোর্ট উইলিয়াম কলেজে হেডরাইটার ও কোষাধ্যক্ষ পদে আবৃত হন। বন্ধু ও হিতৈষীদের সহযোগিতায় সমাজ সংস্কার আন্দোলনের লক্ষ্যে স্থাপনা করেন সর্ব্বশুভকরী সভা। সেপ্টেম্বরে উইলিয়াম ও রবার্ট চেম্বার্স রচিত খ্যাতিমান ইংরেজ মনীষীদের জীবনী অবলম্বনে তার লেখা জীবনচরিত গ্রন্থখানি প্রকাশিত হয়। ১৮৫০ সালের আগস্ট মাসে মদনমোহন তর্কালঙ্কারের সহযোগিতায় সর্ব্বশুভকরী পত্রিকা প্রকাশ করেন। এর প্রথম সংখ্যায় বাল্যবিবাহের দোষ নামে একটি বাংলা প্রবন্ধ প্রকাশিত হয়। ৪ ডিসেম্বর ফোর্ট উইলিয়াের কাজে ইস্তফা দিয়ে ৫ ডিসেম্বর সংস্কৃত কলেজে সাহিত্যের অধ্যাপকের পদ গ্রহণ করেন। ১৮৫১ সালের ৫ জানুয়ারি সাহিত্যের অধ্যাপকের পদ ছাড়াও কলেজের অস্থায়ী সেক্রেটারির কার্যভারও গ্রহণ করেন। ২২ জানুয়ারি ১৫০ টাকা বেতনে কলেজের অধ্যক্ষ নিযুক্ত হন। এই সময় থেকেই সংস্কৃত কলেজে সেক্রেটারির পদটি বিলুপ্ত হয়। এপ্রিল মাসে রুডিমেন্টস অফ নলেজ অবলম্বনে তার রচিত বোধোদয় পুস্তকটি প্রকাশিত হয়। সংস্কৃত কলেজের অধ্যক্ষের দায়িত্বভার নিয়ে তিনি কয়েকটি গুরুত্বপূর্ণ সংস্কার সাধন করেন। ৯ জুলাই পূর্বতন রীতি বদলে ব্রাহ্মণ ও বৈদ্য ছাড়াও কায়স্থদের সংস্কৃত কলেজে অধ্যয়নের সুযোগ করে দেন। ২৬ জুলাই প্রবর্তিত হয় রবিবারের সাপ্তাহিক ছুটির প্রথা। এর আগে প্রতি অষ্টমী ও প্রতিপদ তিথিতে ছুটি থাকত। ডিসেম্বর মাসে সংস্কৃত কলেজের দ্বার সকল বর্ণের মানুষের জন্য উন্মুক্ত করে দেন বিদ্যাসাগর মহাশয়। নিয়ম হয়, যে কোনও সম্ভ্রান্ত হিন্দু সন্তান সংস্কৃত কলেজে অধ্যয়নের সুযোগ পাবে। ১৮৫২ সালের এপ্রিলে ২৬ অনুচ্ছেদ সংবলিত নোটস অন দ্য সংস্কৃত কলেজ প্রস্তুত হয়। ২৮ আগস্ট থেকে কলেজে প্রবেশার্থী ছাত্রদের ২ টাকা দক্ষিণা দেওয়ার প্রথা চালু হয়।\n\n"
              "১৮৫৩ সালে জন্মভূমি বীরসিংহ গ্রামে স্থাপন করেন অবৈতনিক বিদ্যালয়। জুন মাসে কালিদাসের রঘুবংশম্ ও ভারবির কিরাতার্জ্জুনীয়ম্ প্রকাশিত হয় তার সম্পাদনায়। সেপ্টেম্বর মাসে বারাণসীর সংস্কৃত কলেজের অধ্যক্ষ জেমস আর ব্যালানটাইন সংস্কৃত কলেজ পরিদর্শন করে যে রিপোর্ট দেন, তার মতামত সমালোচনা করে শিক্ষা সংসদে একটি রিপোর্ট দেন বিদ্যাসাগর মহাশয়। বাংলার শিক্ষার ইতিহাসে এই রিপোর্ট এক যুগান্তকারী দলিল। এই বছরেই তার প্রসিদ্ধ গ্রন্থ ব্যাকরণ কৌমুদী প্রথম ও দ্বিতীয় ভাগ প্রকাশিত হয়। ১৮৫৪ সালের জানুয়ারি মাসে ইংরেজ সিভিলিয়ানদের প্রাচ্য ভাষা শিক্ষা দেওয়ার জন্য প্রতিষ্ঠিত ফোর্ট উইলিয়াম কলেজ ভেঙে বোর্ড অফ একজামিনার্স গঠিত হলে তার সদস্য মনোনীত হন ঈশ্বরচন্দ্র বিদ্যাসাগর। জুন মাসে সংস্কৃত কলেজে ছাত্রদের থেকে মাসিক ১ টাকা বেতন নেওয়ার প্রথা চালু হয়। এই বছরেই ব্যাকরণ কৌমুদী তৃতীয় ভাগ ও কালিদাসের অভিজ্ঞানশকুন্তলম্ অবলম্বনে তার রচিত শকুন্তলা প্রকাশিত হয়। এছাড়া তত্ত্ববোধিনী পত্রিকা-এ বিধবা বিবাহ প্রচলিত হওয়া উচিত কিনা শীর্ষক একটি প্রবন্ধও প্রকাশিত হয়।\n\n"
              "১৮৫৫ সালের জানুয়ারি মাসে বিধবা বিবাহ প্রচলিত হওয়া উচিত কিনা এতদ্বিষয়ক প্রস্তাব – প্রথম পুস্তক প্রকাশিত। এই বছরের এপ্রিল মাসে বাংলা নববর্ষের দিন যুগান্তকারী বাংলা শিশুপাঠ্য বর্ণমালা শিক্ষাগ্রন্থ বর্ণপরিচয় প্রকাশিত হয়। কথিত আছে, মফস্বলে স্কুল পরিদর্শনে যাওয়ার সময় পাল্কিতে বসে তিনি বর্ণপরিচয়-এর পাণ্ডুলিপি প্রস্তুত করেন। ১ মে সংস্কৃত কলেজের অধ্যক্ষের পদ ছাড়াও মাসিক অতিরিক্ত ২০০ টাকা বেতনে দক্ষিণবঙ্গে সহকারী বিদ্যালয় পরিদর্শকের পদে নিযুক্ত হন। জুন মাসে বর্ণপরিচয় গ্রন্থের দ্বিতীয় ভাগ প্রকাশিত হয়। ১৭ জুলাই বাংলা শিক্ষক প্রশিক্ষণের উদ্দেশ্যে সংস্কৃত কলেজের অধীনে ওই কলেজের প্রাতঃকালীন বিভাগে নর্ম্যাল স্কুল স্থাপন করেন। এই স্কুলে প্রধান শিক্ষক নিযুক্ত হন তার বন্ধু এবং বিশিষ্ট বাঙালি যুক্তিবাদী ও গ্রন্থকার অক্ষয়কুমার দত্ত। এই বছরেই দক্ষিণবঙ্গের চার জেলায় একাধিক মডেল স্কুল বা বঙ্গবিদ্যালয় স্থাপন করেন। আগস্ট-সেপ্টেম্বরে নদিয়ায় পাঁচটি, আগস্ট-অক্টোবরে বর্ধমানে পাঁচটি, আগস্ট-সেপ্টেম্বর-নভেম্বরে হুগলিতে পাঁচটি এবং অক্টোবর-ডিসেম্বরে মেদিনীপুর জেলায় চারটি বঙ্গবিদ্যালয় স্থাপন করেন। অক্টোবর মাসে বিধবা বিবাহ বিরোধী মতের কণ্ঠরোধ করার পর্যাপ্ত শাস্ত্রীয় প্রমাণ সহ বিধবা বিবাহ প্রচলিত হওয়া উচিত কিনা এতদ্বিষয়ক প্রস্তাব – দ্বিতীয় পুস্তক প্রকাশ করেন। বিধবা বিবাহ আইনসম্মত করতে ভারতে নিযুক্ত ব্রিটিশ সরকারের নিকট বহুসাক্ষর সংবলিত এক আবেদনপত্রও পাঠান। ২৭ ডিসেম্বর আরেকটি আবেদনপত্র পাঠান বহু বিবাহ নিবারণ বিধির জন্য।\n\n"
              "১৮৫৬ সালের ১৪ জানুয়ারি মেদিনীপুরে পঞ্চম বঙ্গবিদ্যালয় স্থাপিত হয়। ফেব্রুয়ারি মাসে ঈশপের কাহিনি অবলম্বনে রচিত কথামালা প্রকাশিত হয়। ১৬ জুলাই বিধবা বিবাহ আইনসম্মত হয়। এই দিনই প্রকাশিত হয় তার স্বরচিত গ্রন্থ চরিতাবলী। এই বছর ৭ ডিসেম্বর কলকাতায় প্রথম বিধবা বিবাহ আয়োজিত হয় ১২, সুকিয়া স্ট্রিটে বিদ্যাসাগর মহাশয়ের বন্ধু রাজকৃষ্ণ বন্দ্যোপাধ্যায়ের বাড়িতে। পাত্র ছিলেন প্রসিদ্ধ কথক রামধন তর্কবাগীশের কণিষ্ঠ পুত্র তথা সংস্কৃত কলেজের কৃতি ছাত্র ও অধ্যাপক, বিদ্যাসাগর মহাশয়ের বন্ধু শ্রীশচন্দ্র বিদ্যারত্ন। পাত্রী ছিলেন বর্ধমান জেলার পলাশডাঙা গ্রামের অধিবাসী ব্রহ্মানন্দ মুখোপাধ্যায়ের দ্বাদশ বর্ষীয়া বিধবা কন্যা কালীমতী।\n\n"
              "১৮৫৭ সালের ২৪ জানুয়ারি স্থাপিত হয় কলকাতা বিশ্ববিদ্যালয়। বিশ্ববিদ্যালয়ের পরিচালনা সমিতির অন্যতম সদস্য তথা ফেলো মনোনীত হন বিদ্যাসাগর মহাশয়। উল্লেখ্য এই সমিতির ৩৯ জন সদস্যের মধ্যে মাত্র ছয় জন ছিলেন ভারতীয়। এই বছর নভেম্বর-ডিসেম্বর মাসে হুগলি জেলায় সাতটি ও বর্ধমান জেলায় একটি বালিকা বিদ্যালয় স্থাপন করেন। পরের বছর জানুয়ারি থেকে মে মাসের মধ্যে হুগলিতে আরও তেরোটি, বর্ধমানে দশটি, মেদিনীপুরে তিনটি ও নদিয়ায় একটি বালিকা বিদ্যালয় স্থাপন করেন। ১৮৫৭ সালের নভেম্বর মাস থেকে ১৮৫৮ সালের মে মাস অবধি সমগ্র দক্ষিণবঙ্গে বিদ্যাসাগর মহাশয় ৩৫টি বালিকা বিদ্যালয় স্থাপন করেছিলেন। মোট ১৩০০ ছাত্রীসংবলিত এই বিদ্যালয়গুলির জন্য তার খরচ হত মাসে ৮৪৫ টাকা। এই ১৮৫৮ সালের ৩ নভেম্বর শিক্ষা বিভাগের অধিকর্তার সঙ্গে মতবিরোধ হলে তিনি সংস্কৃত কলেজের অধ্যক্ষের পদ ত্যাগ করেন। প্রায় ৩৯ বছর বয়সে সরকারের সঙ্গে তার সকল সম্পর্ক ছিন্ন হয়। যদিও নিজের কাজের জন্য সরকারের তরফ থেকে কোনও রূপ স্বীকৃতি বা পেনসন তিনি পান নি।",
          BiddaShagarIcon: Icon(Icons.work)
      ),
      BiddaShagarDetails(
        BiddaShagarTitle: "রচনাবলি",
        BiddaShagarSubTitle: "ঈশ্বর চন্দ্র বিদ্যাসাগরের রচনাবলিঃ",
        BiddaShagarDetail: "অঞ্জলি বসু (সম্পাদিত) ; ঈশ্বরচন্দ্র বিদ্যাসাগর : সংসদ বাঙালি চরিতাভিধান, সাহিত্য সংসদ, কলকাতা, ১৯৭৬\n"
    "অমরেন্দ্রকুমার ঘোষ ; যুগপুরুষ বিদ্যাসাগর : তুলিকলম, কলকাতা, ১৯৭৩\n"
    "অমূল্যকৃষ্ণ ঘোষ ; বিদ্যাসাগর : দ্বিতীয় সংস্করণ, এম সি সরকার, কলকাতা, ১৯১৭\n"
    "অসিতকুমার বন্দ্যোপাধ্যায় ; বাংলা সাহিত্যে বিদ্যাসাগর : মণ্ডল বুক হাউস, কলকাতা, ১৯৭০\n"
    "ইন্দ্রমিত্র ; করুণাসাগর বিদ্যাসাগর : আনন্দ পাবলিশার্স, কলকাতা, ১৯৬৬\n"
    "গোপাল হালদার (সম্পাদিত) ; বিদ্যাসাগর রচনা সম্ভার (তিন খণ্ডে) : পশ্চিমবঙ্গ নিরুক্ষরতা দূরীকরণ সমিতি, কলকাতা, ১৯৭৪-৭৬\n"
    "বদরুদ্দীন উমর ; ঈশ্বরচন্দ্র বিদ্যাসাগর ও উনিশ শতকের বাঙালি সমাজ : দ্বিতীয় সংস্করণ, চিরায়ত, কলকাতা, ১৯৮২\n"
    "বিনয় ঘোষ ; বিদ্যাসাগর ও বাঙালি সমাজ : বেঙ্গল পাবলিশার্স, কলকাতা, ১৩৫৪ বঙ্গাব্দ\n"
    "বিনয় ঘোষ ; ঈশ্বরচন্দ্র বিদ্যাসাগর : অনুবাদক অনিতা বসু, তথ্য ও বেতার মন্ত্রক, নয়াদিল্লি, ১৯৭৫\n"
    "ব্রজেন্দ্রকুমার দে ; করুণাসিন্ধু বিদ্যাসাগর : মণ্ডল অ্যান্ড সন্স, কলকাতা, ১৯৭০\n"
    "মহম্মদ আবুল হায় আনিসুজ্জামন ; বিদ্যাসাগর রচনা সংগ্রহ : স্টুডেন্টস ওয়েজ, ঢাকা, ১৯৬৮\n"
    "যোগেন্দ্রনাথ গুপ্ত ; বিদ্যাসাগর : পঞ্চম সংস্করণ, কলকাতা, ১৯৪১\n"
    "যোগীন্দ্রনাথ সরকার ; বিদ্যাসাগর : ১৯০৪\n"
    "রজনীকান্ত গুপ্ত ; ঈশ্বরচন্দ্র বিদ্যাসাগর : ১৮৯৩\n"
    "রমাকান্ত চক্রবর্তী (সম্পাদিত) ; শতবর্ষ স্মরণিকা : বিদ্যাসাগর কলেজ, ১৮৭২-১৯৭২ : বিদ্যাসাগর কলেজ, ১৯৭২\n"
    "রমেশচন্দ্র মজুমদার ; বিদ্যাসাগর : বাংলা গদ্যের সূচনা ও ভারতের নারী প্রগতি : জেনারেল প্রিন্টার্স অ্যান্ড পাবলিশার্স, কলকাতা, ১৩৭৬ বঙ্গাব্দ\n"
    "রবীন্দ্রনাথ ঠাকুর ; বিদ্যাসাগর-চরিত : বিশ্বভারতী গ্রন্থনবিভাগ, কলকাতা\n"
    "রাধারমণ মিত্র ; কলিকাতায় বিদ্যাসাগর : জিজ্ঞাসা, কলিকাতা, ১৯৪২\n"
    "রামেন্দ্রসুন্দর ত্রিবেদী ; চরিত্র কথা : কলকাতা, ১৯১৩\n"
    "শঙ্করীপ্রসাদ বসু ; রসসাগর বিদ্যাসাগর : দ্বিতীয় সংস্করণ, দে’জ পাবলিশিং, কলকাতা, ১৯৯২\n"
    "শঙ্খ ঘোষ ও দেবীপ্রসাদ চট্টোপাধ্যায় (সম্পাদিত) ; বিদ্যাসাগর : ওরিয়েন্ট, কলকাতা\n"
    "শম্ভুচন্দ্র বিদ্যারত্ন ; বিদ্যাসাগর চরিত : কলকাতা, ১২৯৪ বঙ্গাব্দ\n"
    "শম্ভুচন্দ্র বিদ্যারত্ন ; বিদ্যাসাগর জীবনচরিত : কলকাতা\n"
    "শম্ভুচন্দ্র বিদ্যারত্ন ; বিদ্যাসাগর চরিত ও ভ্রমণিরাস : চিরায়ত, কলকাতা, ১৯৯২\n"
    "শশিভূষণ বিদ্যালঙ্কার ; ঈশ্বরচন্দ্র বিদ্যাসাগর : জীবনীকোষ, ভারতীয় ঐতিহাসিক, কলকাতা, ১৯৩৬\n"
    "শামসুজ্জামান মান ও সেলিম হোসেন ; ঈশ্বরচন্দ্র বিদ্যাসাগর : চরিতাভিধান : বাংলা একাডেমী, ঢাকা, ১৯৮৫\n"
    "সুনীতিকুমার চট্টোপাধ্যায়, ব্রজেন্দ্রনাথ বন্দ্যোপাধ্যায় ও সজনীকান্ত দাস (সম্পাদিত) ; বিদ্যাসাগর গ্রন্থাবলী (তিন খণ্ডে) : বিদ্যাসাগর স্মৃতি সংরক্ষণ সমিতি, কলকাতা, ১৩৪৪-৪৬ বঙ্গাব্দ\n"
    "সন্তোষকুমার অধিকারী ; বিদ্যাসাগর জীবনপঞ্জি : সাহিত্যিকা, কলকাতা, ১৯৯২\n"
    "সন্তোষকুমার অধিকারী ; আধুনিক মানসিকতা ও বিদ্যাসাগর : বিদ্যাসাগর রিসার্চ সেন্টার, কলকাতা, ১৯৮৪\n"
    "হরিসাধন গোস্বামী ; মার্কসীয় দৃষ্টিতে বিদ্যাসাগর : ভারতী বুক স্টল, কলকাতা, ১৯৮৮",
          BiddaShagarIcon: Icon(Icons.text_snippet)
      ),
      BiddaShagarDetails(
        BiddaShagarTitle: "পুরস্কার ও সম্মাননা",
        BiddaShagarSubTitle: "ঈশ্বর চন্দ্র বিদ্যাসাগরের পুরস্কার ও সম্মাননাঃ",
        BiddaShagarDetail: "১৮৩৯ সালের ২২ এপ্রিল হিন্দু ল কমিটির পরীক্ষা দেন ঈশ্বরচন্দ্র। এই পরীক্ষাতেও যথারীতি কৃতিত্বের সঙ্গে উত্তীর্ণ হয়ে ১৬ মে ল কমিটির কাছ থেকে যে প্রশংসাপত্রটি পান, তাতেই প্রথম তার নামের সঙ্গে 'বিদ্যাসাগর' উপাধিটি ব্যবহৃত হয়। বিদ্যাসাগর পুরস্কার হল ভারতীয় সমাজ সংস্কারক ঈশ্বরচন্দ্র বিদ্যাসাগরের নামে বিশিষ্টজনেদেরকে সম্মাননা প্রদান কর্মসূচি। ২০১৯ সালে তাঁর ২০০-তম জন্মবার্ষিকীতে বিদ্যাসাগর বিশ্ববিদ্যালয় এটি চালু করে। সংস্কৃত ভাষা ও সাহিত্যে অগাধ পাণ্ডিত্যের জন্য সংস্কৃত কলেজ থেকে ১৮৩৯ সালে তিনি বিদ্যাসাগর উপাধি লাভ করেন। ",
          BiddaShagarIcon: Icon(Icons.card_giftcard)
      ),
      BiddaShagarDetails(
        BiddaShagarTitle: "মৃত্যু",
        BiddaShagarSubTitle: "ঈশ্বর চন্দ্র বিদ্যাসাগরের মৃত্যুঃ",
        BiddaShagarDetail: "বাংলার নবজাগরণের অন্যতম পুরোধা ব্যক্তিত্ব ঈশ্বরচন্দ্র বিদ্যাসাগর প্রয়াত হন ১৮৯১ সালের ২৯ জুলাই, বাংলা ১২৯৮ সনের ১৩ শ্রাবণ, রাত্রি দুটো আঠারো মিনিটে তার কলকাতার বাদুড়বাগানস্থ বাসভবনে। মৃত্যুকালে তার বয়স হয়েছিল ৭০ বছর ১০ মাস ৪ দিন। মৃত্যুর কারণ, ডাক্তারের মতে, লিভারের ক্যানসার।",
          BiddaShagarIcon: Icon(Icons.airline_seat_flat)
      ),
    ];
  }
}