

class SufiaKamalDetails{
  String sufiaKamalTitle= '';
  String sufiakamalSubtitle= '';
  String sufiaKamalDetail='';

  SufiaKamalDetails({
  required this.sufiaKamalTitle,
  required this.sufiakamalSubtitle,
  required this.sufiaKamalDetail,
});
}


class SufiaKamalData{
  static List<SufiaKamalDetails> dataOfSufiaKamal(){
    return [
      SufiaKamalDetails(
          sufiaKamalTitle: "জন্ম পরিচয়",
          sufiakamalSubtitle: "সূফিয়া কামালের জন্ম পরিচয়ঃ",
          sufiaKamalDetail: "সুফিয়া কামাল ১৯১১ সালের ২০ জুন ব্রিটিশ ভারত বরিশালের (বর্তমান: বাংলাদেশ) শায়েস্তাবাদে মামার বাড়িতে জন্মগ্রহণ করেন। তার বাবা কুমিল্লার বাসিন্দা ছিলেন।"
      ),
      SufiaKamalDetails(
          sufiaKamalTitle: "পরিবার ও আত্মীয়স্বজন",
          sufiakamalSubtitle: "সূফিয়া কামালের পরিবার ও আত্মীয়স্বজনঃ",
          sufiaKamalDetail: "তার পিতার নাম সৈয়দ আব্দুল বারী এবং মাতার নাম সৈয়দা সাবেরা খাতুন। \n\n"
              "দাম্পত্যসঙ্গীঃ সৈয়দ নেহাল হোসেন (১৯২২-১৯৩২; বিধবা), কামালউদ্দিন আহমেদ (১৯৩৭-) ।\n\n"
              "সন্তানঃ আমেনা আক্তার,সুলতানা, কামাল, সাঈদা কামাল, শাহেদ কামাল, সাজেদ কামাল ।"
      ),
      SufiaKamalDetails(
          sufiaKamalTitle: "শৈশবকাল",
          sufiakamalSubtitle: "সূফিয়া কামালের শৈশবকালঃ",
          sufiaKamalDetail: "১৯১৮ খ্রিষ্টাব্দে সুফিয়ার যখন সাত বছর বয়স তখন তার বাবা সাধকদের অনুসরণে নিরুদ্দেশ যাত্রা করেন। ফলে তাকে তার মা সাবেরা খাতুন অনেকটা বাধ্য হয়ে বাবার বাড়িতে এসে আশ্রয় নেন। এই কারণে তার শৈশব কেটেছিল নানার বাড়িতে।"
      ),
      SufiaKamalDetails(
          sufiaKamalTitle: "শিক্ষা জীবন",
          sufiakamalSubtitle: "সূফিয়া কামালের শিক্ষা জীবনঃ",
          sufiaKamalDetail: "যে পরিবারে সুফিয়া কামাল জন্মগ্রহণ করেন সেখানে নারীশিক্ষাকে প্রয়োজনীয় মনে করা হত না। তার মাতৃকুল ছিল শায়েস্তাবাদের নবাব পরিবারের এবং সেই পরিবারের কথ্য ভাষা ছিল উর্দু। এই কারণে অন্দরমহলে মেয়েদের আরবি, ফারসি শিক্ষার ব্যবস্থা থাকলেও বাংলা শেখানোর কোন ব্যবস্থা ছিল না। তিনি বাংলা শেখেন মূলত তার মায়ের কাছে। নানাবাড়িতে তার বড় মামার একটি বিরাট গ্রন্থাগার ছিল। মায়ের উৎসাহ ও সহায়তায় এ লাইব্রেরির বই পড়ার সুযোগ ঘটেছিল তার।"
      ),
      SufiaKamalDetails(
          sufiaKamalTitle: "বৈবাহিক জীবন",
          sufiakamalSubtitle: "সূফিয়া কামালের বৈবাহিক জীবনঃ",
          sufiaKamalDetail: "১৯২৪ সনে মাত্র ১৩ বছর বয়সে মামাতো ভাই সৈয়দ নেহাল হোসেনের সাথে সুফিয়ার বিয়ে দেওয়া হয়। নেহাল অপেক্ষাকৃত আধুনিকমনস্ক ছিলেন, তিনি সুফিয়া কামালকে সমাজসেবা ও সাহিত্যচর্চায় উৎসাহিত করেন। সাহিত্য ও সাময়িক পত্রিকার সঙ্গে সুফিয়ার যোগাযোগও ঘটিয়ে দেন তিনি।"
      ),
      SufiaKamalDetails(
          sufiaKamalTitle: "কর্মজীবন",
          sufiakamalSubtitle: "সূফিয়া কামালের কর্মজীবনঃ",
          sufiaKamalDetail: "১৯১৮ সালে কলকাতায় গিয়েছিলেন সুফিয়া কামাল। সেখানে বেগম রোকেয়া সাখাওয়াত হোসেনের সঙ্গে তার দেখা হয়েছিলো। সুফিয়া কামালের শিশুমনে বিশেষ জায়গা করে নিয়েছিলো বেগম রোকেয়ার কথা ও কাজ। সুফিয়া কামালের কাজেকর্মেও ছাপ পাওয়া যায় বেগম রোকেয়ার।\n\n"
              "সাহিত্যপাঠের পাশাপাশি সুফিয়া কামাল সাহিত্য রচনা শুরু করেন। ১৯২৬ সালে তার প্রথম কবিতা 'বাসন্তী' সেসময়ের প্রভাবশালী সাময়িকী সওগাতে প্রকাশিত হয়। ত্রিশের দশকে কলকাতায় অবস্থানকালে বাংলা সাহিত্যের উজ্জ্বল নক্ষত্র যেমন রবীন্দ্রনাথ, নজরুল, শরৎচন্দ্র প্রমুখের দেখা পান। মুসলিম নারীদের সাংস্কৃতিক কর্মকাণ্ডে অংশগ্রহণকে উৎসাহিত করার জন্য বেগম রোকেয়ার প্রতিষ্ঠিত সংগঠন ‘আঞ্জুমানে খাওয়াতিনে ইসলামে’ রোকেয়ার সঙ্গে সুফিয়া কামালের পরিচয় হয়। বেগম রোকেয়ার চিন্তাধারা ও প্রতিজ্ঞা তার মধ্যেও সঞ্চারিত হয়, যা তার জীবনে সুদূরপ্রসারী প্রভাব ফেলে।\n\n"
              "সামাজিক সচেতনতা বৃদ্ধির পাশাপাশি তাঁর সাহিত্যচর্চা চলতে থাকে। ১৯৩৭ সালে তাঁর গল্পের সংকলন কেয়ার কাঁটা প্রকাশিত হয়। ১৯৩৮ সালে তাঁর প্রথম কাব্যগ্রন্থ সাঁঝের মায়ার মুখবন্ধ লেখেন কাজী নজরুল ইসলাম। বইটি বিদগ্ধজনের প্রশংসা কুড়ায় যাদের মাঝে ছিলেন রবীন্দ্রনাথ ঠাকুর।\n\n"
              "১৯৩২ সালে তাঁর স্বামীর আকস্মিক মৃত্যু তাঁকে আর্থিক সমস্যায় নিপতিত করে। তিনি কলকাতা কর্পোরেশন স্কুলে শিক্ষকতা শুরু করেন এবং ১৯৪২ সাল পর্যন্ত এ পেশায় নিয়োজিত থাকেন। এর মাঝে ১৯৩৯ সালে কামালউদ্দিন আহমেদের সাথে তাঁর দ্বিতীয় বিয়ে হয়। দেশবিভাগের পূর্বে কিছু কাল তিনি নারীদের জন্য প্রকাশিত সাময়িকী বেগমের প্রতিষ্ঠাতা সম্পাদিকা ছিলেন।\n\n"
              "১৯৪৭ সালে দেশবিভাগের পর সুফিয়া কামাল পরিবারসহ ঢাকায় চলে আসেন। ভাষা আন্দোলনে তিনি নিজে সক্রিয়ভাবে অংশ নেন এবং এতে অংশ নেওয়ার জন্য নারীদের উদ্বুদ্ধ করেন। ১৯৫৬ সালে শিশুদের সংগঠন কচিকাঁচার মেলা প্রতিষ্ঠা করেন। ঢাকা বিশ্ববিদ্যালয়ের প্রথম মহিলা হোস্টেলকে ‘রোকেয়া হল’ নামকরণের দাবী জানান। ১৯৬১ সালে পাকিস্তান সরকার কর্তৃক রবীন্দ্রসঙ্গীত নিষিদ্ধের প্রতিবাদে সংগঠিত আন্দোলনে তিনি জড়িত ছিলেন। এই বছরে তিনি ছায়ানটের প্রেসিডেন্ট নির্বাচিত হন। ১৯৬৯ সালে মহিলা সংগ্রাম কমিটির সভাপতি নির্বাচিত হন, গণঅভ্যুত্থানে অংশ নেন, পাকিস্তান সরকার কর্তৃক ইতঃপূর্বে প্রদত্ত তমঘা-ই-ইমতিয়াজ পদক বর্জন করেন। ১৯৭০ সালে মহিলা পরিষদ প্রতিষ্ঠা করেন। ১৯৭১ সালের মার্চে অসহযোগ আন্দোলনে নারীদের মিছিলে নেতৃত্ব দেন। মুক্তিযুদ্ধের সময় তার বাসভবন সংলগ্ন গোটা ধানমন্ডি এলাকা পাকিস্তানী বাহিনীর নিরাপত্তা হেফাজতে ছিল, আর ঐ সময় তিনি ধানমন্ডিতে নিজ বাসভবনে সপরিবারে নিরাপদে অবস্থান করেন ।\n\n"
              "স্বাধীন বাংলাদেশে নারীজাগরণ আর সমঅধিকার প্রতিষ্ঠার সংগ্রামে তিনি উজ্জ্বল ভূমিকা রেখে গেছেন। ১৯৯০ সালে স্বৈরাচার বিরোধী আন্দোলনে শরিক হয়েছেন, কার্ফ্যু উপেক্ষা করে নীরব শোভাযাত্রা বের করেছেন। মুক্তবুদ্ধির পক্ষে এবং সাম্প্রদায়িকতা ও মৌলবাদের বিপক্ষে আমৃত্যু তিনি সংগ্রাম করেছেন। প্রতিটি প্রগতিশীল আন্দোলনে অংশ নিয়েছেন।"
      ),
      SufiaKamalDetails(
          sufiaKamalTitle: "রচনাবলি",
          sufiakamalSubtitle: "সূফিয়া কামালের রচনাবলিঃ",
          sufiaKamalDetail: "কাব্যগ্রন্থ-\n"
          " সাঁঝের মায়া (১৯৩৮),\n"
    " মায়া কাজল (১৯৫১),\n"
    " মন ও জীবন (১৯৫৭),\n"
    " প্রশস্তি ও প্রার্থনা (১৯৫৮),\n"
    " উদাত্ত পৃথিবী (১৯৬৪),\n"
    " দিওয়ান (১৯৬৬),\n"
    " অভিযাত্রিক (১৯৬৯),\n"
    " মৃত্তিকার ঘ্রাণ (১৯৭০),\n"
    " মোর জাদুদের সমাধি পরে (১৯৭২)।\n\n"
    "গল্প-\n"
    " কেয়ার কাঁটা (১৯৩৭),\n\n"
    "ভ্রমনকাহিনীঃ\n\n"
    " সোভিয়েতে দিনগুলি (১৯৬৮)।\n\n"
    "স্মৃতিকথা-\n"
    " একাত্তরের ডায়েরি (১৯৮৯)।\n\n"
    "আত্মজীবনীমূলক রচনা-\n"
    " একালে আমাদের কাল (১৯৮৮)।\n\n"
    "শিশুতোষ-\n"
    " ইতল বিতল (১৯৬৫)।\n"
    " নওল কিশোরের দরবারে (১৯৮১)।\n\n"
    "অনুবাদ-\n"
    " সাঁঝের মায়া - বলশেভনী সুমের্কী (রুশ) (১৯৮৪) ।"
      ),
      SufiaKamalDetails(
          sufiaKamalTitle: "পুরস্কার ও সম্মাননা",
          sufiakamalSubtitle: "সূফিয়া কামালের পুরস্কার ও সম্মাননাঃ",
          sufiaKamalDetail: "সুফিয়া কামাল ৫০টির বেশি পুরস্কার লাভ করেছেন। এর মাঝে কয়েকটি-\n\n"
          "পাকিস্তান সরকারের তমঘা-ই-ইমতিয়াজ (১৯৬১) (প্রত্যাখান করেন ১৯৬৯),\n"
    "বাংলা একাডেমী পুরস্কার (১৯৬২),\n"
    "সোভিয়েত লেনিন পদক (১৯৭০),\n"
    "একুশে পদক (১৯৭৬),\n"
    "নাসিরউদ্দিন স্বর্ণপদক (১৯৭৭),\n"
    "সংগ্রামী নারী পুরস্কার, চেকোশ্লোভাকিয়া (১৯৮১),\n"
    "মুক্তধারা পুরস্কার (১৯৮২),\n"
    "বেগম রোকেয়া পদক (১৯৯৬),\n"
    "জাতীয় কবিতা পরিষদ পুরস্কার (১৯৯৫),\n"
    "দেশবন্ধু সি আর দাস গোল্ড মেডেল (১৯৯৬),\n"
    "স্বাধীনতা পুরস্কার (১৯৯৭) ।"
      ),
      SufiaKamalDetails(
          sufiaKamalTitle: "মৃত্যু",
          sufiakamalSubtitle: "সূফিয়া কামালের মৃত্যুঃ",
          sufiaKamalDetail: "১৯৯৯ সালের ২০ নভেম্বর সুফিয়া কামাল মৃত্যুবরণ করেন। তাকে পূর্ণ রাষ্ট্রীয় মর্যাদায় সমাহিত করা হয়। বাংলাদেশী নারীদের মধ্যে তিনিই প্রথম এই সম্মান লাভ করেন। প্রতি বছর এই দিনটিতে তাকে আনুষ্ঠানিকভাবে স্মরণ করা হয়।"
      ),


    ];
  }
}