

class FarrukhDetails{
  String farrukhTitle='';
  String farrukhSubTitle='';
  String farrukhDetail='';

  FarrukhDetails({
    required this.farrukhTitle,
    required this.farrukhSubTitle,
    required this.farrukhDetail,
});

}

class FarrukhData{
  static List<FarrukhDetails> dataOfFarrukh(){
    return [
      FarrukhDetails(
          farrukhTitle: "জন্ম পরিচয়",
          farrukhSubTitle: "ফররুখ আহমদের জন্ম পরিচয়ঃ",
          farrukhDetail: "সৈয়দ ফররুখ আহমদের জন্ম ১৯১৮ খ্রিষ্টাব্দে (তৎকালীন যশোর জেলার অন্তর্গত) মাগুরার শ্রীপুর উপজেলার মাঝাইল গ্রামের সৈয়দ বংশে।"),
      FarrukhDetails(
          farrukhTitle: "পরিবার ও আত্মীয়স্বজন",
          farrukhSubTitle: "ফররুখ আহমদের পরিবার ও আত্মীয়স্বজনঃ",
          farrukhDetail: "তার বাবা সৈয়দ হাতেম আলী ছিলেন একজন পুলিশ ইন্সপেক্টর। ফররুখ আহমদের মায়ের নাম রওশন আখতার।\n\n"
              "দাম্পত্যসঙ্গীঃ সৈয়দা তৈয়বা খাতুন (লিলি) ।\n\n"
          "ফররুখ আহমদের ছেলে-মেয়ে এগারো জন। তারা হলেন: সৈয়দা শামারুখ বানু, সৈয়দা লালারুখ বানু, সৈয়দ আবদুল্লাহল মাহমুদ, সৈয়দ আবদুল্লাহেল মাসুদ, সৈয়দ মনজুরে এলাহি, সৈয়দা ইয়াসমিন বানু, সৈয়দ মুহম্মদ আখতারুজ্জামান (আহমদ আখতার), সৈয়দ মুহম্মদ ওয়হিদুজ্জামান, সৈয়দ মুখলিসুর রহমান, সৈয়দ খলিলুর রহমান ও সৈয়দ মুহম্মদ আবদুহু।"
      ),
      FarrukhDetails(
          farrukhTitle: "শৈশবকাল",
          farrukhSubTitle: "ফররুখ আহমদের শৈশবকালঃ",
          farrukhDetail: "ফররুখ আহমদ মাগুরার শ্রীপুর উপজেলার মাঝাইল গ্রামে তিনি তার শৈশবকাল অতিবাহিত করেন ।"),
      FarrukhDetails(
          farrukhTitle: "শিক্ষা জীবন",
          farrukhSubTitle: "ফররুখ আহমদের শিক্ষা জীবনঃ",
          farrukhDetail: "ফররুখ আহমদ খুলনা জিলা স্কুল থেকে ১৯৩৭ সালে ম্যাট্রিক এবং কলকাতার রিপন কলেজ থেকে ১৯৩৯ সালে আই.এ. পাস করেন। এরপর স্কটিশ চার্চ কলেজে দর্শন এবং ইংরেজি সাহিত্য নিয়ে পড়াশোনা শুরু করেন। ছাত্রাবস্থায় তিনি বামপন্থী রাজনীতিতে ঝুঁকে পড়েন। তবে চল্লিশ-এর দশকে তার রাজনৈতিক বিশ্বাসে পরিবর্তন আসে। তিনি ভারত বিভাগ তথা পাকিস্তান আন্দোলন সমর্থন করেন।"),
      FarrukhDetails(
          farrukhTitle: "বৈবাহিক জীবন",
          farrukhSubTitle: "ফররুখ আহমদের বৈবাহিক জীবনঃ",
          farrukhDetail: "১৯৪২ সালের নভেম্বর মাসে আপন খালাতো বোন সৈয়দা তৈয়বা খাতুন (লিলি)-এর সঙ্গে ফররুখ আহমদের বিয়ে হয়। তার নিজের বিয়ে উপলক্ষে ফররুখ 'উপহার' নামে একটি কবিতা লেখেন যা সওগাত পত্রিকায় অগ্রহায়ণ ১৩৪৯ সংখ্যায় ছাপা হয়।"),
      FarrukhDetails(
          farrukhTitle: "কর্মজীবন",
          farrukhSubTitle: "ফররুখ আহমদের কর্মজীবনঃ",
          farrukhDetail: "ফররুখ আহমদের কর্মজীবন শুরু হয় কোলকাতায়। ১৯৪৩ সালে আই.জি.প্রিজন অফিসে, ১৯৪৪ সালে সিভিল সাপ্লাইতে এবং ১৯৪৬ সালে জলপাইগুড়িতে একটি ফার্মে চাকরি করেন তিনি। ১৯৪৫ সালে তিনি মাসিক মোহাম্মদীর ভারপ্রাপ্ত সম্পাদক হিসেবে দায়িত্ব পালন শুরু করেন। তবে শেষ পর্যন্ত স্থায়ীভাবে চাকরি করেন ঢাকা বেতারে। দেশ বিভাগের পর ১৯৪৮ সালে ফররুখ আহমদ কলকাতা থেকে ঢাকায় চলে এসে ঢাকা বেতারে যোগ দেন। এখানেই প্রথমে অনিয়মিত হিসেবে এবং পরে নিয়মিত স্টাফ আর্টিস্ট হিসেবে ১৯৭২ সাল পর্যন্ত কর্মরত ছিলেন। ফররুখ আহমদ মৃত্যুবরণ করেন ১৯৭৪ সালের ১৯ অক্টোবর, সন্ধেবেলা ঢাকায়।"),
      FarrukhDetails(
          farrukhTitle: "রচনাবলি",
          farrukhSubTitle: "ফররুখ আহমদের রচনাবলিঃ",
          farrukhDetail: "রচনাশৈলীঃ\n"
    " সাহিত্যের নানা শাখায় বিচরণ করলেও তার প্রধান পরিচয় 'কবি'। ফররুখ আহমদ সনেটও রচনা করেছেন। তার রচনায় ধর্মীয় ভাবধারার প্রভাব দেখা যায়। এছাড়া আরবি ও ফারসি শব্দের প্রাচুর্য তার লেখার অন্যতম বৈশিষ্ট্য। ইসলামি ঐতিহ্যের প্রতি ছিল তার অগাধ আস্থা। তবে তিনি পাকিস্তানের রাষ্ট্রভাষা হিসেবে বাংলার সমর্থন করতেন।\n\n"

    "কাব্যগ্রন্থঃ\n"
    " সাত সাগরের মাঝি (ডিসেম্বর, ১৯৪৪),\n"
    " সিরাজাম মুনীরা (সেপ্টেম্বর, ১৯৫২),\n"
    " নৌফেল ও হাতেম (জুন, ১৯৬১)-কাব্যনাট্য,\n"
    " মুহূর্তের কবিতা (সেপ্টেম্বর, ১৯৬৩),\n"
    " ধোলাই কাব্য (জানুয়ারি, ১৯৬৩),\n"
    " হাতেম তায়ী (মে, ১৯৬৬)-কাহিনীকাব্য,\n"
    " নতুন লেখা (১৯৬৯),\n"
    " কাফেলা (অগাস্ট, ১৯৮০),\n"
    " হাবিদা মরুর কাহিনী (সেপ্টেম্বর, ১৯৮১),\n"
    " সিন্দাবাদ (অক্টোবর, ১৯৮৩),\n"
    " দিলরুবা (ফেব্রুয়ারি, ১৯৯৪),\n\n"
    "শিশুতোষ গ্রন্থঃ\n"
    " পাখির বাসা (১৯৬৫),\n"
    " হরফের ছড়া (১৯৭০),\n"
    " চাঁদের আসর (১৯৭০),\n"
    " ছড়ার আসর (১৯৭০),\n"
    " ফুলের জলসা (ডিসেম্বর, ১৯৮৫) ।"),
      FarrukhDetails(
          farrukhTitle: "পুরস্কার ও সম্মাননা",
          farrukhSubTitle: "ফররুখ আহমদের পুরস্কার ও সম্মাননাঃ",
          farrukhDetail: "১৯৬০ সালে ফররুখ আহমদ বাংলা একাডেমি পুরস্কার লাভ করেন। কবি ফররুখ আহমদ ১৯৬৫ সনে প্রেসিডেন্ট পদক প্রাইড অব পারফরমেন্স এবং ১৯৬৬ সালে পান আদমজী সাহিত্য পুরস্কার ও ইউনেস্কো পুরস্কার। ১৯৭৭ ও ১৯৮০ সালে তাকে যথাক্রমে মরণোত্তর একুশে পদক ও স্বাধীনতা পদক দেওয়া হয়।"),
      FarrukhDetails(
          farrukhTitle: "মৃত্যু",
          farrukhSubTitle: "ফররুখ আহমদের মৃত্যুঃ",
          farrukhDetail: "১৯ অক্টোবর ১৯৭৪ সালে ৫৬ বছর বয়সে ঢাকায় মৃত্যুবরন করেন ।"),
  ];
}
}
