import 'package:flutter/material.dart';

class JasimUddinDetails{
  String jasimUddinTitle='';
  String jasimUddinSubtitle='';
  String jasimUddinDetail='';
  Icon? jasimUddinIcon;

  JasimUddinDetails({
    required this.jasimUddinTitle,
    required this.jasimUddinSubtitle,
    required this.jasimUddinDetail,
    required this.jasimUddinIcon
});
}

class JasimuddinData{
  static List<JasimUddinDetails> dataOfJasimUddin(){
    return [
      JasimUddinDetails(
          jasimUddinTitle: "জন্ম পরিচয়",
          jasimUddinSubtitle: "জসীম উদ্‌দীনের জন্ম পরিচয়ঃ",
          jasimUddinDetail: "জসীম উদ্‌দীন ১৯০৩ সালের ১ জানুয়ারি ফরিদপুর জেলার তাম্বুলখানা গ্রামে জন্মগ্রহণ করেন। মোহাম্মাদ জসীম উদ্‌দীন মোল্লা তার পূর্ণ নাম হলেও তিনি জসীম উদ্‌দীন নামেই পরিচিত। তার বাবার বাড়ি ছিল একই জেলার গোবিন্দপুর গ্রামে।",
          jasimUddinIcon: Icon(Icons.tag_faces)),
      JasimUddinDetails(
          jasimUddinTitle: "পরিবার ও আত্মীয়স্বজন",
          jasimUddinSubtitle: "জসীম উদ্‌দীনের পরিবার ও আত্মীয়স্বজনঃ",
          jasimUddinDetail: "বাবার নাম আনসার উদ্দিন মোল্লা। তিনি পেশায় একজন স্কুল শিক্ষক ছিলেন। মা আমিনা খাতুন ওরফে রাঙাছুট। স্ত্রী ছিলেন মমতাজ ।",
          jasimUddinIcon: Icon(Icons.group)),
      JasimUddinDetails(
          jasimUddinTitle: "শৈশবকাল",
          jasimUddinSubtitle: "জসীম উদ্‌দীনের শৈশবকালঃ",
          jasimUddinDetail: "জসীম উদ্‌দীন তাম্বুলখানা গ্রামে বড় হয়েছেন । তার বাবার বাড়ি ছিল একই জেলার গোবিন্দপুর গ্রামে। এখানেই তিনি তার শৈশবকাল কাটিয়েছেন ।",
          jasimUddinIcon: Icon(Icons.child_care)),
      JasimUddinDetails(
          jasimUddinTitle: "শিক্ষা জীবন",
          jasimUddinSubtitle: "জসীম উদ্‌দীনের শিক্ষা জীবনঃ",
          jasimUddinDetail: "জসীম উদ্ দীন ফরিদপুর ওয়েলফেয়ার স্কুল ও পরবর্তীতে ফরিদপুর জেলা স্কুলে (বর্তমানে ফরিদপুর জিলা স্কুল) পড়ালেখা করেন। এখান থেকে তিনি তার প্রবেশিকা পরীক্ষায় ১৯২১ সনে উত্তীর্ণ হন। তিনি কলকাতা বিশ্ববিদ্যালয় বাংলা বিষয় থেকে বি. এ. এবং এম. এ. শেষ করেন যথাক্রমে ১৯২৯ এবং ১৯৩১ সনে।",
          jasimUddinIcon: Icon(Icons.group_add)),
      JasimUddinDetails(
          jasimUddinTitle: "বৈবাহিক জীবন",
          jasimUddinSubtitle: "জসীম উদ্‌দীনের বৈবাহিক জীবনঃ",
          jasimUddinDetail: "প্ললী কবি জসীম উদ্‌দীন মমতাজ নামের এক মেয়েকে বিয়ে করেছিলেন । মেয়েটি তখন ক্লাস নাইনে পড়তো । আর থাকতো নানা-নানির কাছে ।",
          jasimUddinIcon: Icon(Icons.work)),
      JasimUddinDetails(
          jasimUddinTitle: "কর্মজীবন",
          jasimUddinSubtitle: "জসীম উদ্‌দীনের কর্মজীবনঃ",
          jasimUddinDetail: "১৯৩১ থেকে ১৯৩৭ পর্যন্ত, দীনেশচন্দ্র সেনের সাথে লোক সাহিত্য সংগ্রাহক হিসেবে জসীম উদ্‌দীন কাজ করেন। তিনি পূর্ব বঙ্গ গীতিকার একজন সংগ্রাহকও। তিনি ১০,০০০ এরও বেশি লোক সংগীত সংগ্রহ করেছেন, যার কিছু অংশ তার সংগীত সংকলন জারি গান এবং মুর্শিদা গান এ স্থান পেয়েছে। তিনি বাংলা লোক সাহিত্যের বিশদ ব্যাখ্যা এবং দর্শন খণ্ড আকারেও লিখে গেছেন।\n"
                "১৯৩৩ সনে তিনি কলকাতা বিশ্ববিদ্যালয়ের ড. দীনেশচন্দ্র সেনের অধীনে রামতনু লাহিড়ী গবেষণা সহকারী পদে যোগ দেন। এরপর ১৯৩৮ সনে ঢাকা বিশ্ববিদ্যালয়ে বাংলা বিভাগের প্রভাষক হিসেবে যোগ দেন। তিনি ১৯৪৪ সালে বিশ্ববিদ্যালয় ছেড়ে এবং তথ্য ও সম্প্রচার বিভাগে যোগ দেন। ১৯৬২ সালে অবসর গ্রহণের পূর্ব মুহূর্ত পর্যন্ত তিনি ডেপুটি ডিরেক্টর হিসেবে কাজ করে গেছেন। তিনি গুরু মৃত্যুন জয় সিলের কাছে গুণগ্রাহী ছিলেন।",
          jasimUddinIcon: Icon(Icons.text_snippet)),
      JasimUddinDetails(
          jasimUddinTitle: "রচনাবলি",
          jasimUddinSubtitle: "জসীম উদ্‌দীনের রচনাবলিঃ",
          jasimUddinDetail: "কাব্যগ্রন্থঃ\n\n"
    "রাখালী (১৯২৭)\n"
    "নকশী কাঁথার মাঠ (১৯২৯)\n"
    "বালুচর (১৯৩০)\n"
    "ধানখেত (১৯৩৩)\n"
    "সোজন বাদিয়ার ঘাট (১৯৩৪)\n"
    "হাসু (১৯৩৮)\n"
    "রুপবতি (১৯৪৬)\n"
    "মাটির কান্না (১৯৫১)\n"
    "এক পয়সার বাঁশী (১৯৫৬)\n"
    "সখিনা (১৯৫৯)\n"
    "সুচয়নী (১৯৬১)\n"
    "ভয়াবহ সেই দিনগুলিতে (১৯৬২)\n"
    "মা যে জননী কান্দে (১৯৬৩)\n"
    "হলুদ বরণী (১৯৬৬)\n"
    "জলে লেখন (১৯৬৯)\n"
    "পদ্মা নদীর দেশে (১৯৬৯)\n"
    "কাফনের মিছিল (১৯৭৮)\n"
    "মহরম\n"
    "দুমুখো চাঁদ পাহাড়ি (১৯৮৭)\n\n"
    "নাটকঃ\n"
    "পদ্মাপার (১৯৫০)\n"
    "বেদের মেয়ে (১৯৫১)\n"
    "মধুমালা (১৯৫১)\n"
    "পল্লীবধূ (১৯৫৬)\n"
    "গ্রামের মেয়ে (১৯৫৯)\n"
    "ওগো পুস্পধনু (১৯৬৮)\n"
    "আসমান সিংহ (১৯৮৬)\n\n"
    "আত্মকথাঃ\n"
    "যাদের দেখেছি ((১৯৫১)\n"
    "ঠাকুর বাড়ির আঙ্গিনায় (১৯৬১)\n"
    "জীবন কথা ( ১৯৬৪)\n"
    "স্মৃতিপট (১৯৬৪)\n"
    "স্মরণের সরণী বাহি (১৯৭৮)\n\n"
    "উপন্যাসঃ\n"
    "বোবা কাহিনী (১৯৬৪)\n\n"
    "ভ্রমণ কাহিনীঃ\n"
    "চলে মুসাফির (১৯৫২)\n"
    "হলদে পরির দেশে ( ১৯৬৭)\n"
    "যে দেশে মানুষ বড় (১৯৬৮)\n"
    "জার্মানীর শহরে বন্দরে (১৯৭৫)\n\n"
    "সঙ্গীতঃ\n"
    "জসীমউদদীনের গানের তালিকা\n"
    "রঙিলা নায়ের মাঝি (১৯৩৫)\n"
    "গাঙের পাড় (১৯৬৪)\n"
    "জারি গান (১৯৬৮)\n"
    "মুর্শিদী গান (১৯৭৭)\n\n"
    "অন্যান্যঃ\n"
    "বাঙালির হাসির গল্প ১ম খন্ড (১৯৬০), ২য় খন্ড (১৯৬৪)\n"
    "ডালিমকুমার (১৯৮৬)",
          jasimUddinIcon: Icon(Icons.card_giftcard)),
      JasimUddinDetails(
          jasimUddinTitle: "পুরস্কার ও সম্মাননা",
          jasimUddinSubtitle: "জসীম উদ্‌দীনের পুরস্কার ও সম্মাননাঃ",
          jasimUddinDetail: "প্রেসিডেন্টস এওয়ার্ড ফর প্রাইড অফ পারফরম্যান্স, পাকিস্তান (১৯৫৮)\n"
              "রবীন্দ্র ভারতী বিশ্ববিদ্যালয় থেকে ডি. লিট ডিগ্রি, ভারত (১৯৬৯)\n"
              "১৯৭৪ সনে তিনি বাংলা একাডেমি পুরস্কার প্রত্যাখ্যান করেন\n"
              "একুশে পদক, বাংলাদেশ (১৯৭৬)\n"
              "স্বাধীনতা দিবস পুরস্কার ১৯৭৮ (মরণোত্তর)\n"
          "১৯৬৯ সনে রবীন্দ্র ভারতী বিশ্ববিদ্যালয় কবিকে সম্মান সূচক ডি লিট উপাধিতে ভূষিত করেন।",
          jasimUddinIcon: Icon(Icons.airline_seat_flat)),
      JasimUddinDetails(
          jasimUddinTitle: "মৃত্যু",
          jasimUddinSubtitle: "জসীম উদ্‌দীনের মৃত্যুঃ",
          jasimUddinDetail: "তিনি ১৪ মার্চ ১৯৭৬ সনে ঢাকায় মৃত্যুবরণ করেন। তার শেষ ইচ্ছা অনুসারে তাকে ফরিদপুর জেলার আম্বিকাপুর গ্রামে তার দাদীর কবরের পাশে দাফন করা হয়।[৭] গোবিন্দপুরে প্রতিবছর জানুয়ারি মাসে তার জন্মদিনকে স্মরণ করে জসীম মেলা নামে একটি পাক্ষিক উৎসব উদ্‌যাপন করা হয়। তার নামে ঢাকা বিশ্ববিদ্যালয়ের একটি আবাসিক হলের নামকরণ করা হয়েছে।",
          jasimUddinIcon: Icon(Icons.airline_seat_flat)),
    ];
  }
}